{"gold_label": "neutral", "sentence1": "A person on a horse jumps over a broken down airplane.", "sentence2": {"original": ["A person is training his horse for a competition."], "negation": ["No person is training his horse for a competition."], "past progressive": ["A person was training his horse for a competition."], "past simple": ["A person trained his horse for a competition."], "present progressive": ["A person is training his horse for a competition."], "present simple": ["A person trains his horse for a competition."], "future progressive": ["A person will be training his horse for a competition."], "future simple": ["A person will train his horse for a competition."], "modality: may": ["A person may be training his horse for a competition."], "it cleft: ARG1": ["It is a person who is training his horse for a competition.", "It is a person which is training his horse for a competition.", "It is a person that is training his horse for a competition."], "it cleft: ARG2": ["It is his horse who is being trained by a person for a competition.", "It is his horse which is being trained by a person for a competition.", "It is his horse that is being trained by a person for a competition."], "passive: ARG2": ["His horse is being trained by a person for a competition."], "native": ["A person is training his horse for a competition."], "swap subj/obj": ["His horse is training a person for a competition."], "negation+it cleft: ARG1": ["It is no person who is training his horse for a competition.", "It is no person which is training his horse for a competition.", "It is no person that is training his horse for a competition."], "negation+it cleft: ARG2": ["It is his horse who is being trained by no person for a competition.", "It is his horse which is being trained by no person for a competition.", "It is his horse that is being trained by no person for a competition."], "negation+passive: ARG2": ["His horse is being trained by no person for a competition."], "past progressive+it cleft: ARG1": ["It is a person who was training his horse for a competition.", "It is a person which was training his horse for a competition.", "It is a person that was training his horse for a competition."], "past progressive+it cleft: ARG2": ["It is his horse who was being trained by a person for a competition.", "It is his horse which was being trained by a person for a competition.", "It is his horse that was being trained by a person for a competition."], "past progressive+passive: ARG2": ["His horse was being trained by a person for a competition."], "past simple+it cleft: ARG1": ["It is a person who trained his horse for a competition.", "It is a person which trained his horse for a competition.", "It is a person that trained his horse for a competition."], "past simple+it cleft: ARG2": ["It is his horse who was trained by a person for a competition.", "It is his horse which was trained by a person for a competition.", "It is his horse that was trained by a person for a competition."], "past simple+passive: ARG2": ["His horse was trained by a person for a competition."], "present progressive+it cleft: ARG1": ["It is a person who is training his horse for a competition.", "It is a person which is training his horse for a competition.", "It is a person that is training his horse for a competition."], "present progressive+it cleft: ARG2": ["It is his horse who is being trained by a person for a competition.", "It is his horse which is being trained by a person for a competition.", "It is his horse that is being trained by a person for a competition."], "present progressive+passive: ARG2": ["His horse is being trained by a person for a competition."], "present simple+it cleft: ARG1": ["It is a person who trains his horse for a competition.", "It is a person which trains his horse for a competition.", "It is a person that trains his horse for a competition."], "present simple+it cleft: ARG2": ["It is his horse who is trained by a person for a competition.", "It is his horse which is trained by a person for a competition.", "It is his horse that is trained by a person for a competition."], "present simple+passive: ARG2": ["His horse is trained by a person for a competition."], "future progressive+it cleft: ARG1": ["It is a person who will be training his horse for a competition.", "It is a person which will be training his horse for a competition.", "It is a person that will be training his horse for a competition."], "future progressive+it cleft: ARG2": ["It is his horse who will be being trained by a person for a competition.", "It is his horse which will be being trained by a person for a competition.", "It is his horse that will be being trained by a person for a competition."], "future progressive+passive: ARG2": ["His horse will be being trained by a person for a competition."], "future simple+it cleft: ARG1": ["It is a person who will train his horse for a competition.", "It is a person which will train his horse for a competition.", "It is a person that will train his horse for a competition."], "future simple+it cleft: ARG2": ["It is his horse who will be trained by a person for a competition.", "It is his horse which will be trained by a person for a competition.", "It is his horse that will be trained by a person for a competition."], "future simple+passive: ARG2": ["His horse will be trained by a person for a competition."], "it cleft: ARG1+passive: ARG2": ["It is a person who his horse is being trained by for a competition.", "It is a person which his horse is being trained by for a competition.", "It is a person that his horse is being trained by for a competition.", "It is a person by which his horse is being trained for a competition.", "It is a person by who his horse is being trained for a competition.", "It is a person his horse is being trained by for a competition."], "swap subj/obj+it cleft: ARG1": ["It is his horse who is training a person for a competition.", "It is his horse which is training a person for a competition.", "It is his horse that is training a person for a competition."], "swap subj/obj+it cleft: ARG2": ["It is a person who is being trained by his horse for a competition.", "It is a person which is being trained by his horse for a competition.", "It is a person that is being trained by his horse for a competition."], "swap subj/obj+passive: ARG2": ["A person is being trained by his horse for a competition."]}, "pairID": "3416050480.jpg#4r1n", "captionID": "3416050480.jpg#4"}
{"gold_label": "contradiction", "sentence1": "A person on a horse jumps over a broken down airplane.", "sentence2": {"original": ["A person is at a diner, ordering an omelette."], "negation": ["Ordering an omelette no person is at a Diner.", "No person is at a Diner ordering an omelette."], "past progressive": ["Ordering an omelette a person was being at a Diner.", "A person was being at a Diner ordering an omelette."], "past simple": ["Ordering an omelette a person was at a Diner.", "A person was at a Diner ordering an omelette."], "present progressive": ["Ordering an omelette a person is being at a Diner.", "A person is being at a Diner ordering an omelette."], "present simple": ["Ordering an omelette a person is at a Diner.", "A person is at a Diner ordering an omelette."], "future progressive": ["Ordering an omelette a person will be being at a Diner.", "A person will be being at a Diner ordering an omelette."], "future simple": ["Ordering an omelette a person will be at a Diner.", "A person will be at a Diner ordering an omelette."], "modality: may": ["Ordering an omelette a person may be at a Diner.", "A person may be at a Diner ordering an omelette."], "it cleft: ARG1": ["Ordering an omelette it is a person who is at a Diner.", "Ordering an omelette it is a person which is at a Diner.", "Ordering an omelette it is a person that is at a Diner.", "It is a person which is at a Diner ordering an omelette.", "It is a person that is at a Diner ordering an omelette.", "It is a person who is at a Diner ordering an omelette."], "native": ["Ordering an omelette a person is at a Diner.", "A person is at a Diner ordering an omelette."], "swap subj/obj": ["Ordering an omelette a Diner is at a person.", "A Diner is at a person ordering an omelette."], "negation+it cleft: ARG1": ["Ordering an omelette it is no person who is at a Diner.", "Ordering an omelette it is no person which is at a Diner.", "Ordering an omelette it is no person that is at a Diner.", "It is no person which is at a Diner ordering an omelette.", "It is no person that is at a Diner ordering an omelette.", "It is no person who is at a Diner ordering an omelette."], "past progressive+it cleft: ARG1": ["Ordering an omelette it is a person who was being at a Diner.", "Ordering an omelette it is a person which was being at a Diner.", "Ordering an omelette it is a person that was being at a Diner.", "It is a person which was being at a Diner ordering an omelette.", "It is a person that was being at a Diner ordering an omelette.", "It is a person who was being at a Diner ordering an omelette."], "past simple+it cleft: ARG1": ["Ordering an omelette it is a person who was at a Diner.", "Ordering an omelette it is a person which was at a Diner.", "Ordering an omelette it is a person that was at a Diner.", "It is a person which was at a Diner ordering an omelette.", "It is a person that was at a Diner ordering an omelette.", "It is a person who was at a Diner ordering an omelette."], "present progressive+it cleft: ARG1": ["Ordering an omelette it is a person who is being at a Diner.", "Ordering an omelette it is a person which is being at a Diner.", "Ordering an omelette it is a person that is being at a Diner.", "It is a person which is being at a Diner ordering an omelette.", "It is a person that is being at a Diner ordering an omelette.", "It is a person who is being at a Diner ordering an omelette."], "present simple+it cleft: ARG1": ["Ordering an omelette it is a person who is at a Diner.", "Ordering an omelette it is a person which is at a Diner.", "Ordering an omelette it is a person that is at a Diner.", "It is a person which is at a Diner ordering an omelette.", "It is a person that is at a Diner ordering an omelette.", "It is a person who is at a Diner ordering an omelette."], "future progressive+it cleft: ARG1": ["Ordering an omelette it is a person who will be being at a Diner.", "Ordering an omelette it is a person which will be being at a Diner.", "Ordering an omelette it is a person that will be being at a Diner.", "It is a person which will be being at a Diner ordering an omelette.", "It is a person that will be being at a Diner ordering an omelette.", "It is a person who will be being at a Diner ordering an omelette."], "future simple+it cleft: ARG1": ["Ordering an omelette it is a person who will be at a Diner.", "Ordering an omelette it is a person which will be at a Diner.", "Ordering an omelette it is a person that will be at a Diner.", "It is a person which will be at a Diner ordering an omelette.", "It is a person that will be at a Diner ordering an omelette.", "It is a person who will be at a Diner ordering an omelette."], "swap subj/obj+it cleft: ARG1": ["Ordering an omelette it is a Diner who is at a person.", "Ordering an omelette it is a Diner which is at a person.", "Ordering an omelette it is a Diner that is at a person.", "It is a Diner which is at a person ordering an omelette.", "It is a Diner that is at a person ordering an omelette.", "It is a Diner who is at a person ordering an omelette."]}, "pairID": "3416050480.jpg#4r1c", "captionID": "3416050480.jpg#4"}
{"gold_label": "entailment", "sentence1": "A person on a horse jumps over a broken down airplane.", "sentence2": {"original": ["A person is outdoors, on a horse."], "negation": ["No person is on a horse outdoors."], "past progressive": ["A person was being on a horse outdoors."], "past simple": ["A person was on a horse outdoors."], "present progressive": ["A person is being on a horse outdoors."], "present simple": ["A person is on a horse outdoors."], "future progressive": ["A person will be being on a horse outdoors."], "future simple": ["A person will be on a horse outdoors."], "modality: may": ["A person may be on a horse outdoors."], "it cleft: ARG1": ["It is a person who is on a horse outdoors.", "It is a person which is on a horse outdoors.", "It is a person that is on a horse outdoors."], "native": ["A person is on a horse outdoors."], "swap subj/obj": ["A horse is on a person outdoors."], "negation+it cleft: ARG1": ["It is no person who is on a horse outdoors.", "It is no person which is on a horse outdoors.", "It is no person that is on a horse outdoors."], "past progressive+it cleft: ARG1": ["It is a person who was being on a horse outdoors.", "It is a person which was being on a horse outdoors.", "It is a person that was being on a horse outdoors."], "past simple+it cleft: ARG1": ["It is a person who was on a horse outdoors.", "It is a person which was on a horse outdoors.", "It is a person that was on a horse outdoors."], "present progressive+it cleft: ARG1": ["It is a person who is being on a horse outdoors.", "It is a person which is being on a horse outdoors.", "It is a person that is being on a horse outdoors."], "present simple+it cleft: ARG1": ["It is a person who is on a horse outdoors.", "It is a person which is on a horse outdoors.", "It is a person that is on a horse outdoors."], "future progressive+it cleft: ARG1": ["It is a person who will be being on a horse outdoors.", "It is a person which will be being on a horse outdoors.", "It is a person that will be being on a horse outdoors."], "future simple+it cleft: ARG1": ["It is a person who will be on a horse outdoors.", "It is a person which will be on a horse outdoors.", "It is a person that will be on a horse outdoors."], "swap subj/obj+it cleft: ARG1": ["It is a horse who is on a person outdoors.", "It is a horse which is on a person outdoors.", "It is a horse that is on a person outdoors."]}, "pairID": "3416050480.jpg#4r1e", "captionID": "3416050480.jpg#4"}
{"gold_label": "contradiction", "sentence1": {"original": ["A man tells a story as he sits among friends and a couple pints of beer."], "negation": ["As he sits among friends and a couple pints of beer no man tells a story.", "No man tells a story as he sits among friends and a couple pints of beer."], "past progressive": ["As he sits among friends and a couple pints of beer a man was telling a story.", "A man was telling a story as he sits among friends and a couple pints of beer."], "past simple": ["As he sits among friends and a couple pints of beer a man told a story.", "A man told a story as he sits among friends and a couple pints of beer."], "present progressive": ["As he sits among friends and a couple pints of beer a man is telling a story.", "A man is telling a story as he sits among friends and a couple pints of beer."], "present simple": ["As he sits among friends and a couple pints of beer a man tells a story.", "A man tells a story as he sits among friends and a couple pints of beer."], "future progressive": ["As he sits among friends and a couple pints of beer a man will be telling a story.", "A man will be telling a story as he sits among friends and a couple pints of beer."], "future simple": ["As he sits among friends and a couple pints of beer a man will tell a story.", "A man will tell a story as he sits among friends and a couple pints of beer."], "modality: may": ["As he sits among friends and a couple pints of beer a man may tell a story.", "A man may tell a story as he sits among friends and a couple pints of beer."], "it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who tells a story.", "As he sits among friends and a couple pints of beer it is a man which tells a story.", "As he sits among friends and a couple pints of beer it is a man that tells a story.", "It is a man who tells a story as he sits among friends and a couple pints of beer.", "It is a man which tells a story as he sits among friends and a couple pints of beer.", "It is a man that tells a story as he sits among friends and a couple pints of beer."], "it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by a man.", "As he sits among friends and a couple pints of beer it is a story which is told by a man.", "As he sits among friends and a couple pints of beer it is a story that is told by a man.", "It is a story who is told by a man as he sits among friends and a couple pints of beer.", "It is a story which is told by a man as he sits among friends and a couple pints of beer.", "It is a story that is told by a man as he sits among friends and a couple pints of beer."], "passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by a man.", "A story is told by a man as he sits among friends and a couple pints of beer."], "native": ["As he sits among friends and a couple pints of beer a man tells a story.", "A man tells a story as he sits among friends and a couple pints of beer."], "swap subj/obj": ["As he sits among friends and a couple pints of beer a story tells a man.", "A story tells a man as he sits among friends and a couple pints of beer."], "negation+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is no man who tells a story.", "As he sits among friends and a couple pints of beer it is no man which tells a story.", "As he sits among friends and a couple pints of beer it is no man that tells a story.", "It is no man who tells a story as he sits among friends and a couple pints of beer.", "It is no man which tells a story as he sits among friends and a couple pints of beer.", "It is no man that tells a story as he sits among friends and a couple pints of beer."], "negation+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by no man.", "As he sits among friends and a couple pints of beer it is a story which is told by no man.", "As he sits among friends and a couple pints of beer it is a story that is told by no man.", "It is a story who is told by no man as he sits among friends and a couple pints of beer.", "It is a story which is told by no man as he sits among friends and a couple pints of beer.", "It is a story that is told by no man as he sits among friends and a couple pints of beer."], "negation+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by no man.", "A story is told by no man as he sits among friends and a couple pints of beer."], "past progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who was telling a story.", "As he sits among friends and a couple pints of beer it is a man which was telling a story.", "As he sits among friends and a couple pints of beer it is a man that was telling a story.", "It is a man who was telling a story as he sits among friends and a couple pints of beer.", "It is a man which was telling a story as he sits among friends and a couple pints of beer.", "It is a man that was telling a story as he sits among friends and a couple pints of beer."], "past progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who was being told by a man.", "As he sits among friends and a couple pints of beer it is a story which was being told by a man.", "As he sits among friends and a couple pints of beer it is a story that was being told by a man.", "It is a story who was being told by a man as he sits among friends and a couple pints of beer.", "It is a story which was being told by a man as he sits among friends and a couple pints of beer.", "It is a story that was being told by a man as he sits among friends and a couple pints of beer."], "past progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story was being told by a man.", "A story was being told by a man as he sits among friends and a couple pints of beer."], "past simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who told a story.", "As he sits among friends and a couple pints of beer it is a man which told a story.", "As he sits among friends and a couple pints of beer it is a man that told a story.", "It is a man who told a story as he sits among friends and a couple pints of beer.", "It is a man which told a story as he sits among friends and a couple pints of beer.", "It is a man that told a story as he sits among friends and a couple pints of beer."], "past simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who was told by a man.", "As he sits among friends and a couple pints of beer it is a story which was told by a man.", "As he sits among friends and a couple pints of beer it is a story that was told by a man.", "It is a story who was told by a man as he sits among friends and a couple pints of beer.", "It is a story which was told by a man as he sits among friends and a couple pints of beer.", "It is a story that was told by a man as he sits among friends and a couple pints of beer."], "past simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story was told by a man.", "A story was told by a man as he sits among friends and a couple pints of beer."], "present progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who is telling a story.", "As he sits among friends and a couple pints of beer it is a man which is telling a story.", "As he sits among friends and a couple pints of beer it is a man that is telling a story.", "It is a man who is telling a story as he sits among friends and a couple pints of beer.", "It is a man which is telling a story as he sits among friends and a couple pints of beer.", "It is a man that is telling a story as he sits among friends and a couple pints of beer."], "present progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is being told by a man.", "As he sits among friends and a couple pints of beer it is a story which is being told by a man.", "As he sits among friends and a couple pints of beer it is a story that is being told by a man.", "It is a story who is being told by a man as he sits among friends and a couple pints of beer.", "It is a story which is being told by a man as he sits among friends and a couple pints of beer.", "It is a story that is being told by a man as he sits among friends and a couple pints of beer."], "present progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is being told by a man.", "A story is being told by a man as he sits among friends and a couple pints of beer."], "present simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who tells a story.", "As he sits among friends and a couple pints of beer it is a man which tells a story.", "As he sits among friends and a couple pints of beer it is a man that tells a story.", "It is a man who tells a story as he sits among friends and a couple pints of beer.", "It is a man which tells a story as he sits among friends and a couple pints of beer.", "It is a man that tells a story as he sits among friends and a couple pints of beer."], "present simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by a man.", "As he sits among friends and a couple pints of beer it is a story which is told by a man.", "As he sits among friends and a couple pints of beer it is a story that is told by a man.", "It is a story who is told by a man as he sits among friends and a couple pints of beer.", "It is a story which is told by a man as he sits among friends and a couple pints of beer.", "It is a story that is told by a man as he sits among friends and a couple pints of beer."], "present simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by a man.", "A story is told by a man as he sits among friends and a couple pints of beer."], "future progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who will be telling a story.", "As he sits among friends and a couple pints of beer it is a man which will be telling a story.", "As he sits among friends and a couple pints of beer it is a man that will be telling a story.", "It is a man who will be telling a story as he sits among friends and a couple pints of beer.", "It is a man which will be telling a story as he sits among friends and a couple pints of beer.", "It is a man that will be telling a story as he sits among friends and a couple pints of beer."], "future progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who will be being told by a man.", "As he sits among friends and a couple pints of beer it is a story which will be being told by a man.", "As he sits among friends and a couple pints of beer it is a story that will be being told by a man.", "It is a story who will be being told by a man as he sits among friends and a couple pints of beer.", "It is a story which will be being told by a man as he sits among friends and a couple pints of beer.", "It is a story that will be being told by a man as he sits among friends and a couple pints of beer."], "future progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story will be being told by a man.", "A story will be being told by a man as he sits among friends and a couple pints of beer."], "future simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who will tell a story.", "As he sits among friends and a couple pints of beer it is a man which will tell a story.", "As he sits among friends and a couple pints of beer it is a man that will tell a story.", "It is a man who will tell a story as he sits among friends and a couple pints of beer.", "It is a man which will tell a story as he sits among friends and a couple pints of beer.", "It is a man that will tell a story as he sits among friends and a couple pints of beer."], "future simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who will be told by a man.", "As he sits among friends and a couple pints of beer it is a story which will be told by a man.", "As he sits among friends and a couple pints of beer it is a story that will be told by a man.", "It is a story who will be told by a man as he sits among friends and a couple pints of beer.", "It is a story which will be told by a man as he sits among friends and a couple pints of beer.", "It is a story that will be told by a man as he sits among friends and a couple pints of beer."], "future simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story will be told by a man.", "A story will be told by a man as he sits among friends and a couple pints of beer."], "it cleft: ARG1+passive: ARG2": ["As he sits among friends and a couple pints of beer it is a man who a story is told by.", "As he sits among friends and a couple pints of beer it is a man which a story is told by.", "As he sits among friends and a couple pints of beer it is a man that a story is told by.", "As he sits among friends and a couple pints of beer it is a man by which a story is told.", "As he sits among friends and a couple pints of beer it is a man by who a story is told.", "As he sits among friends and a couple pints of beer it is a man a story is told by.", "It is a man who a story is told by as he sits among friends and a couple pints of beer.", "It is a man which a story is told by as he sits among friends and a couple pints of beer.", "It is a man that a story is told by as he sits among friends and a couple pints of beer.", "It is a man by which a story is told as he sits among friends and a couple pints of beer.", "It is a man by who a story is told as he sits among friends and a couple pints of beer.", "It is a man a story is told by as he sits among friends and a couple pints of beer."], "swap subj/obj+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a story who tells a man.", "As he sits among friends and a couple pints of beer it is a story which tells a man.", "As he sits among friends and a couple pints of beer it is a story that tells a man.", "It is a story who tells a man as he sits among friends and a couple pints of beer.", "It is a story which tells a man as he sits among friends and a couple pints of beer.", "It is a story that tells a man as he sits among friends and a couple pints of beer."], "swap subj/obj+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a man who is told by a story.", "As he sits among friends and a couple pints of beer it is a man which is told by a story.", "As he sits among friends and a couple pints of beer it is a man that is told by a story.", "It is a man who is told by a story as he sits among friends and a couple pints of beer.", "It is a man which is told by a story as he sits among friends and a couple pints of beer.", "It is a man that is told by a story as he sits among friends and a couple pints of beer."], "swap subj/obj+passive: ARG2": ["As he sits among friends and a couple pints of beer a man is told by a story.", "A man is told by a story as he sits among friends and a couple pints of beer."]}, "sentence2": "The guy is dying.", "pairID": "3023485450.jpg#1r1c", "captionID": "3023485450.jpg#1"}
{"gold_label": "entailment", "sentence1": {"original": ["A man tells a story as he sits among friends and a couple pints of beer."], "negation": ["As he sits among friends and a couple pints of beer no man tells a story.", "No man tells a story as he sits among friends and a couple pints of beer."], "past progressive": ["As he sits among friends and a couple pints of beer a man was telling a story.", "A man was telling a story as he sits among friends and a couple pints of beer."], "past simple": ["As he sits among friends and a couple pints of beer a man told a story.", "A man told a story as he sits among friends and a couple pints of beer."], "present progressive": ["As he sits among friends and a couple pints of beer a man is telling a story.", "A man is telling a story as he sits among friends and a couple pints of beer."], "present simple": ["As he sits among friends and a couple pints of beer a man tells a story.", "A man tells a story as he sits among friends and a couple pints of beer."], "future progressive": ["As he sits among friends and a couple pints of beer a man will be telling a story.", "A man will be telling a story as he sits among friends and a couple pints of beer."], "future simple": ["As he sits among friends and a couple pints of beer a man will tell a story.", "A man will tell a story as he sits among friends and a couple pints of beer."], "modality: may": ["As he sits among friends and a couple pints of beer a man may tell a story.", "A man may tell a story as he sits among friends and a couple pints of beer."], "it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who tells a story.", "As he sits among friends and a couple pints of beer it is a man which tells a story.", "As he sits among friends and a couple pints of beer it is a man that tells a story.", "It is a man who tells a story as he sits among friends and a couple pints of beer.", "It is a man which tells a story as he sits among friends and a couple pints of beer.", "It is a man that tells a story as he sits among friends and a couple pints of beer."], "it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by a man.", "As he sits among friends and a couple pints of beer it is a story which is told by a man.", "As he sits among friends and a couple pints of beer it is a story that is told by a man.", "It is a story who is told by a man as he sits among friends and a couple pints of beer.", "It is a story which is told by a man as he sits among friends and a couple pints of beer.", "It is a story that is told by a man as he sits among friends and a couple pints of beer."], "passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by a man.", "A story is told by a man as he sits among friends and a couple pints of beer."], "native": ["As he sits among friends and a couple pints of beer a man tells a story.", "A man tells a story as he sits among friends and a couple pints of beer."], "swap subj/obj": ["As he sits among friends and a couple pints of beer a story tells a man.", "A story tells a man as he sits among friends and a couple pints of beer."], "negation+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is no man who tells a story.", "As he sits among friends and a couple pints of beer it is no man which tells a story.", "As he sits among friends and a couple pints of beer it is no man that tells a story.", "It is no man who tells a story as he sits among friends and a couple pints of beer.", "It is no man which tells a story as he sits among friends and a couple pints of beer.", "It is no man that tells a story as he sits among friends and a couple pints of beer."], "negation+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by no man.", "As he sits among friends and a couple pints of beer it is a story which is told by no man.", "As he sits among friends and a couple pints of beer it is a story that is told by no man.", "It is a story who is told by no man as he sits among friends and a couple pints of beer.", "It is a story which is told by no man as he sits among friends and a couple pints of beer.", "It is a story that is told by no man as he sits among friends and a couple pints of beer."], "negation+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by no man.", "A story is told by no man as he sits among friends and a couple pints of beer."], "past progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who was telling a story.", "As he sits among friends and a couple pints of beer it is a man which was telling a story.", "As he sits among friends and a couple pints of beer it is a man that was telling a story.", "It is a man who was telling a story as he sits among friends and a couple pints of beer.", "It is a man which was telling a story as he sits among friends and a couple pints of beer.", "It is a man that was telling a story as he sits among friends and a couple pints of beer."], "past progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who was being told by a man.", "As he sits among friends and a couple pints of beer it is a story which was being told by a man.", "As he sits among friends and a couple pints of beer it is a story that was being told by a man.", "It is a story who was being told by a man as he sits among friends and a couple pints of beer.", "It is a story which was being told by a man as he sits among friends and a couple pints of beer.", "It is a story that was being told by a man as he sits among friends and a couple pints of beer."], "past progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story was being told by a man.", "A story was being told by a man as he sits among friends and a couple pints of beer."], "past simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who told a story.", "As he sits among friends and a couple pints of beer it is a man which told a story.", "As he sits among friends and a couple pints of beer it is a man that told a story.", "It is a man who told a story as he sits among friends and a couple pints of beer.", "It is a man which told a story as he sits among friends and a couple pints of beer.", "It is a man that told a story as he sits among friends and a couple pints of beer."], "past simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who was told by a man.", "As he sits among friends and a couple pints of beer it is a story which was told by a man.", "As he sits among friends and a couple pints of beer it is a story that was told by a man.", "It is a story who was told by a man as he sits among friends and a couple pints of beer.", "It is a story which was told by a man as he sits among friends and a couple pints of beer.", "It is a story that was told by a man as he sits among friends and a couple pints of beer."], "past simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story was told by a man.", "A story was told by a man as he sits among friends and a couple pints of beer."], "present progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who is telling a story.", "As he sits among friends and a couple pints of beer it is a man which is telling a story.", "As he sits among friends and a couple pints of beer it is a man that is telling a story.", "It is a man who is telling a story as he sits among friends and a couple pints of beer.", "It is a man which is telling a story as he sits among friends and a couple pints of beer.", "It is a man that is telling a story as he sits among friends and a couple pints of beer."], "present progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is being told by a man.", "As he sits among friends and a couple pints of beer it is a story which is being told by a man.", "As he sits among friends and a couple pints of beer it is a story that is being told by a man.", "It is a story who is being told by a man as he sits among friends and a couple pints of beer.", "It is a story which is being told by a man as he sits among friends and a couple pints of beer.", "It is a story that is being told by a man as he sits among friends and a couple pints of beer."], "present progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is being told by a man.", "A story is being told by a man as he sits among friends and a couple pints of beer."], "present simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who tells a story.", "As he sits among friends and a couple pints of beer it is a man which tells a story.", "As he sits among friends and a couple pints of beer it is a man that tells a story.", "It is a man who tells a story as he sits among friends and a couple pints of beer.", "It is a man which tells a story as he sits among friends and a couple pints of beer.", "It is a man that tells a story as he sits among friends and a couple pints of beer."], "present simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who is told by a man.", "As he sits among friends and a couple pints of beer it is a story which is told by a man.", "As he sits among friends and a couple pints of beer it is a story that is told by a man.", "It is a story who is told by a man as he sits among friends and a couple pints of beer.", "It is a story which is told by a man as he sits among friends and a couple pints of beer.", "It is a story that is told by a man as he sits among friends and a couple pints of beer."], "present simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story is told by a man.", "A story is told by a man as he sits among friends and a couple pints of beer."], "future progressive+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who will be telling a story.", "As he sits among friends and a couple pints of beer it is a man which will be telling a story.", "As he sits among friends and a couple pints of beer it is a man that will be telling a story.", "It is a man who will be telling a story as he sits among friends and a couple pints of beer.", "It is a man which will be telling a story as he sits among friends and a couple pints of beer.", "It is a man that will be telling a story as he sits among friends and a couple pints of beer."], "future progressive+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who will be being told by a man.", "As he sits among friends and a couple pints of beer it is a story which will be being told by a man.", "As he sits among friends and a couple pints of beer it is a story that will be being told by a man.", "It is a story who will be being told by a man as he sits among friends and a couple pints of beer.", "It is a story which will be being told by a man as he sits among friends and a couple pints of beer.", "It is a story that will be being told by a man as he sits among friends and a couple pints of beer."], "future progressive+passive: ARG2": ["As he sits among friends and a couple pints of beer a story will be being told by a man.", "A story will be being told by a man as he sits among friends and a couple pints of beer."], "future simple+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a man who will tell a story.", "As he sits among friends and a couple pints of beer it is a man which will tell a story.", "As he sits among friends and a couple pints of beer it is a man that will tell a story.", "It is a man who will tell a story as he sits among friends and a couple pints of beer.", "It is a man which will tell a story as he sits among friends and a couple pints of beer.", "It is a man that will tell a story as he sits among friends and a couple pints of beer."], "future simple+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a story who will be told by a man.", "As he sits among friends and a couple pints of beer it is a story which will be told by a man.", "As he sits among friends and a couple pints of beer it is a story that will be told by a man.", "It is a story who will be told by a man as he sits among friends and a couple pints of beer.", "It is a story which will be told by a man as he sits among friends and a couple pints of beer.", "It is a story that will be told by a man as he sits among friends and a couple pints of beer."], "future simple+passive: ARG2": ["As he sits among friends and a couple pints of beer a story will be told by a man.", "A story will be told by a man as he sits among friends and a couple pints of beer."], "it cleft: ARG1+passive: ARG2": ["As he sits among friends and a couple pints of beer it is a man who a story is told by.", "As he sits among friends and a couple pints of beer it is a man which a story is told by.", "As he sits among friends and a couple pints of beer it is a man that a story is told by.", "As he sits among friends and a couple pints of beer it is a man by which a story is told.", "As he sits among friends and a couple pints of beer it is a man by who a story is told.", "As he sits among friends and a couple pints of beer it is a man a story is told by.", "It is a man who a story is told by as he sits among friends and a couple pints of beer.", "It is a man which a story is told by as he sits among friends and a couple pints of beer.", "It is a man that a story is told by as he sits among friends and a couple pints of beer.", "It is a man by which a story is told as he sits among friends and a couple pints of beer.", "It is a man by who a story is told as he sits among friends and a couple pints of beer.", "It is a man a story is told by as he sits among friends and a couple pints of beer."], "swap subj/obj+it cleft: ARG1": ["As he sits among friends and a couple pints of beer it is a story who tells a man.", "As he sits among friends and a couple pints of beer it is a story which tells a man.", "As he sits among friends and a couple pints of beer it is a story that tells a man.", "It is a story who tells a man as he sits among friends and a couple pints of beer.", "It is a story which tells a man as he sits among friends and a couple pints of beer.", "It is a story that tells a man as he sits among friends and a couple pints of beer."], "swap subj/obj+it cleft: ARG2": ["As he sits among friends and a couple pints of beer it is a man who is told by a story.", "As he sits among friends and a couple pints of beer it is a man which is told by a story.", "As he sits among friends and a couple pints of beer it is a man that is told by a story.", "It is a man who is told by a story as he sits among friends and a couple pints of beer.", "It is a man which is told by a story as he sits among friends and a couple pints of beer.", "It is a man that is told by a story as he sits among friends and a couple pints of beer."], "swap subj/obj+passive: ARG2": ["As he sits among friends and a couple pints of beer a man is told by a story.", "A man is told by a story as he sits among friends and a couple pints of beer."]}, "sentence2": {"original": ["A guy is telling something to people."], "negation": ["No guy is telling something to people."], "past progressive": ["A guy was telling something to people."], "past simple": ["A guy told something to people."], "present progressive": ["A guy is telling something to people."], "present simple": ["A guy tells something to people."], "future progressive": ["A guy will be telling something to people."], "future simple": ["A guy will tell something to people."], "modality: may": ["A guy may be telling something to people."], "it cleft: ARG1": ["It is a guy who is telling something to people.", "It is a guy which is telling something to people.", "It is a guy that is telling something to people."], "it cleft: ARG2": ["It is something to people who is being told by a guy.", "It is something to people which is being told by a guy.", "It is something to people that is being told by a guy."], "passive: ARG2": ["Something to people is being told by a guy."], "native": ["A guy is telling something to people."], "swap subj/obj": ["Something to people is telling a guy."], "negation+it cleft: ARG1": ["It is no guy who is telling something to people.", "It is no guy which is telling something to people.", "It is no guy that is telling something to people."], "negation+it cleft: ARG2": ["It is something to people who is being told by no guy.", "It is something to people which is being told by no guy.", "It is something to people that is being told by no guy."], "negation+passive: ARG2": ["Something to people is being told by no guy."], "past progressive+it cleft: ARG1": ["It is a guy who was telling something to people.", "It is a guy which was telling something to people.", "It is a guy that was telling something to people."], "past progressive+it cleft: ARG2": ["It is something to people who was being told by a guy.", "It is something to people which was being told by a guy.", "It is something to people that was being told by a guy."], "past progressive+passive: ARG2": ["Something to people was being told by a guy."], "past simple+it cleft: ARG1": ["It is a guy who told something to people.", "It is a guy which told something to people.", "It is a guy that told something to people."], "past simple+it cleft: ARG2": ["It is something to people who was told by a guy.", "It is something to people which was told by a guy.", "It is something to people that was told by a guy."], "past simple+passive: ARG2": ["Something to people was told by a guy."], "present progressive+it cleft: ARG1": ["It is a guy who is telling something to people.", "It is a guy which is telling something to people.", "It is a guy that is telling something to people."], "present progressive+it cleft: ARG2": ["It is something to people who is being told by a guy.", "It is something to people which is being told by a guy.", "It is something to people that is being told by a guy."], "present progressive+passive: ARG2": ["Something to people is being told by a guy."], "present simple+it cleft: ARG1": ["It is a guy who tells something to people.", "It is a guy which tells something to people.", "It is a guy that tells something to people."], "present simple+it cleft: ARG2": ["It is something to people who is told by a guy.", "It is something to people which is told by a guy.", "It is something to people that is told by a guy."], "present simple+passive: ARG2": ["Something to people is told by a guy."], "future progressive+it cleft: ARG1": ["It is a guy who will be telling something to people.", "It is a guy which will be telling something to people.", "It is a guy that will be telling something to people."], "future progressive+it cleft: ARG2": ["It is something to people who will be being told by a guy.", "It is something to people which will be being told by a guy.", "It is something to people that will be being told by a guy."], "future progressive+passive: ARG2": ["Something to people will be being told by a guy."], "future simple+it cleft: ARG1": ["It is a guy who will tell something to people.", "It is a guy which will tell something to people.", "It is a guy that will tell something to people."], "future simple+it cleft: ARG2": ["It is something to people who will be told by a guy.", "It is something to people which will be told by a guy.", "It is something to people that will be told by a guy."], "future simple+passive: ARG2": ["Something to people will be told by a guy."], "it cleft: ARG1+passive: ARG2": ["It is a guy who something to people is being told by.", "It is a guy which something to people is being told by.", "It is a guy that something to people is being told by.", "It is a guy by which something to people is being told.", "It is a guy by who something to people is being told.", "It is a guy something to people is being told by."], "swap subj/obj+it cleft: ARG1": ["It is something to people who is telling a guy.", "It is something to people which is telling a guy.", "It is something to people that is telling a guy."], "swap subj/obj+it cleft: ARG2": ["It is a guy who is being told by something to people.", "It is a guy which is being told by something to people.", "It is a guy that is being told by something to people."], "swap subj/obj+passive: ARG2": ["A guy is being told by something to people."]}, "pairID": "3023485450.jpg#1r1e", "captionID": "3023485450.jpg#1"}
{"gold_label": "neutral", "sentence1": {"original": ["A woman is riding a bicycle on the pavement."], "negation": ["No woman is riding a bicycle on the pavement."], "past progressive": ["A woman was riding a bicycle on the pavement."], "past simple": ["A woman rode a bicycle on the pavement."], "present progressive": ["A woman is riding a bicycle on the pavement."], "present simple": ["A woman rides a bicycle on the pavement."], "future progressive": ["A woman will be riding a bicycle on the pavement."], "future simple": ["A woman will ride a bicycle on the pavement."], "modality: may": ["A woman may be riding a bicycle on the pavement."], "it cleft: ARG1": ["It is a woman who is riding a bicycle on the pavement.", "It is a woman which is riding a bicycle on the pavement.", "It is a woman that is riding a bicycle on the pavement."], "it cleft: ARG2": ["It is a bicycle on the pavement who is being ridden by a woman.", "It is a bicycle on the pavement which is being ridden by a woman.", "It is a bicycle on the pavement that is being ridden by a woman."], "passive: ARG2": ["A bicycle on the pavement is being ridden by a woman."], "native": ["A woman is riding a bicycle on the pavement."], "swap subj/obj": ["A bicycle on the pavement is riding a woman."], "negation+it cleft: ARG1": ["It is no woman who is riding a bicycle on the pavement.", "It is no woman which is riding a bicycle on the pavement.", "It is no woman that is riding a bicycle on the pavement."], "negation+it cleft: ARG2": ["It is a bicycle on the pavement who is being ridden by no woman.", "It is a bicycle on the pavement which is being ridden by no woman.", "It is a bicycle on the pavement that is being ridden by no woman."], "negation+passive: ARG2": ["A bicycle on the pavement is being ridden by no woman."], "past progressive+it cleft: ARG1": ["It is a woman who was riding a bicycle on the pavement.", "It is a woman which was riding a bicycle on the pavement.", "It is a woman that was riding a bicycle on the pavement."], "past progressive+it cleft: ARG2": ["It is a bicycle on the pavement who was being ridden by a woman.", "It is a bicycle on the pavement which was being ridden by a woman.", "It is a bicycle on the pavement that was being ridden by a woman."], "past progressive+passive: ARG2": ["A bicycle on the pavement was being ridden by a woman."], "past simple+it cleft: ARG1": ["It is a woman who rode a bicycle on the pavement.", "It is a woman which rode a bicycle on the pavement.", "It is a woman that rode a bicycle on the pavement."], "past simple+it cleft: ARG2": ["It is a bicycle on the pavement who was ridden by a woman.", "It is a bicycle on the pavement which was ridden by a woman.", "It is a bicycle on the pavement that was ridden by a woman."], "past simple+passive: ARG2": ["A bicycle on the pavement was ridden by a woman."], "present progressive+it cleft: ARG1": ["It is a woman who is riding a bicycle on the pavement.", "It is a woman which is riding a bicycle on the pavement.", "It is a woman that is riding a bicycle on the pavement."], "present progressive+it cleft: ARG2": ["It is a bicycle on the pavement who is being ridden by a woman.", "It is a bicycle on the pavement which is being ridden by a woman.", "It is a bicycle on the pavement that is being ridden by a woman."], "present progressive+passive: ARG2": ["A bicycle on the pavement is being ridden by a woman."], "present simple+it cleft: ARG1": ["It is a woman who rides a bicycle on the pavement.", "It is a woman which rides a bicycle on the pavement.", "It is a woman that rides a bicycle on the pavement."], "present simple+it cleft: ARG2": ["It is a bicycle on the pavement who is ridden by a woman.", "It is a bicycle on the pavement which is ridden by a woman.", "It is a bicycle on the pavement that is ridden by a woman."], "present simple+passive: ARG2": ["A bicycle on the pavement is ridden by a woman."], "future progressive+it cleft: ARG1": ["It is a woman who will be riding a bicycle on the pavement.", "It is a woman which will be riding a bicycle on the pavement.", "It is a woman that will be riding a bicycle on the pavement."], "future progressive+it cleft: ARG2": ["It is a bicycle on the pavement who will be being ridden by a woman.", "It is a bicycle on the pavement which will be being ridden by a woman.", "It is a bicycle on the pavement that will be being ridden by a woman."], "future progressive+passive: ARG2": ["A bicycle on the pavement will be being ridden by a woman."], "future simple+it cleft: ARG1": ["It is a woman who will ride a bicycle on the pavement.", "It is a woman which will ride a bicycle on the pavement.", "It is a woman that will ride a bicycle on the pavement."], "future simple+it cleft: ARG2": ["It is a bicycle on the pavement who will be ridden by a woman.", "It is a bicycle on the pavement which will be ridden by a woman.", "It is a bicycle on the pavement that will be ridden by a woman."], "future simple+passive: ARG2": ["A bicycle on the pavement will be ridden by a woman."], "it cleft: ARG1+passive: ARG2": ["It is a woman who a bicycle on the pavement is being ridden by.", "It is a woman which a bicycle on the pavement is being ridden by.", "It is a woman that a bicycle on the pavement is being ridden by.", "It is a woman by which a bicycle on the pavement is being ridden.", "It is a woman by who a bicycle on the pavement is being ridden.", "It is a woman a bicycle on the pavement is being ridden by."], "swap subj/obj+it cleft: ARG1": ["It is a bicycle on the pavement who is riding a woman.", "It is a bicycle on the pavement which is riding a woman.", "It is a bicycle on the pavement that is riding a woman."], "swap subj/obj+it cleft: ARG2": ["It is a woman who is being ridden by a bicycle on the pavement.", "It is a woman which is being ridden by a bicycle on the pavement.", "It is a woman that is being ridden by a bicycle on the pavement."], "swap subj/obj+passive: ARG2": ["A woman is being ridden by a bicycle on the pavement."]}, "sentence2": {"original": ["woman riding on the sidewalk"]}, "pairID": "128395402.jpg#3r1n", "captionID": "128395402.jpg#3"}
{"gold_label": "neutral", "sentence1": {"original": ["Three dogs running in the dirt."]}, "sentence2": {"original": ["Three dogs running in a race on a dirt track outside."]}, "pairID": "3250076419.jpg#3r1n", "captionID": "3250076419.jpg#3"}
{"gold_label": "entailment", "sentence1": {"original": ["Three dogs running in the dirt."]}, "sentence2": {"original": ["Three dogs running in the dirt outside."]}, "pairID": "3250076419.jpg#3r1e", "captionID": "3250076419.jpg#3"}
{"gold_label": "contradiction", "sentence1": {"original": ["Three dogs running in the dirt."]}, "sentence2": {"original": ["Three dogs sleeping close together."]}, "pairID": "3250076419.jpg#3r1c", "captionID": "3250076419.jpg#3"}
{"gold_label": "neutral", "sentence1": {"original": ["i cannot see an image here."], "negation": ["I can not not see an image here.", "I cannot not see an image here.", "I can't not see an image here."], "native": ["I can not see an image here.", "I cannot see an image here.", "I can't see an image here."], "swap subj/obj": ["An image can not see me here.", "An image cannot see me here.", "An image can't see me here."]}, "sentence2": {"original": ["A black picture."]}, "pairID": "4793562214.jpg#4r1n", "captionID": "4793562214.jpg#4"}
{"gold_label": "contradiction", "sentence1": {"original": ["Three dogs running in the water."]}, "sentence2": {"original": ["three dogs eating ice creams"], "past progressive": ["Three dogs, eating of ice was creaming.", "Three dogs, eating ice was creaming."], "past simple": ["Three dogs, eating of ice creamed.", "Three dogs, eating ice creamed."], "present progressive": ["Three dogs, eating of ice is creaming.", "Three dogs, eating ice is creaming."], "present simple": ["Three dogs, eating of ice creams.", "Three dogs, eating ice creams."], "future progressive": ["Three dogs, eating of ice will be creaming.", "Three dogs, eating ice will be creaming."], "future simple": ["Three dogs, eating of ice will cream.", "Three dogs, eating ice will cream."], "native": ["Three dogs, eating of ice creams.", "Three dogs, eating ice creams."], "swap subj/obj+passive: ARG2": ["Three dogs, eating of ice is creamed by.", "By three dogs, eating of ice is creamed.", "Three dogs, eating ice is creamed by.", "By three dogs, eating ice is creamed."]}, "pairID": "3086507638.jpg#4r1c", "captionID": "3086507638.jpg#4"}
{"gold_label": "entailment", "sentence1": {"original": ["Three dogs running in the water."]}, "sentence2": {"original": ["three dogs swimming in the water"]}, "pairID": "3086507638.jpg#4r1e", "captionID": "3086507638.jpg#4"}
{"gold_label": "entailment", "sentence1": "A striped dog is running in the desert.", "sentence2": "An animal runs outdoors.", "pairID": "506343925.jpg#2r1e", "captionID": "506343925.jpg#2"}
{"gold_label": "contradiction", "sentence1": "A striped dog is running in the desert.", "sentence2": "A polka dotted dog runs in the grass.", "pairID": "506343925.jpg#2r1c", "captionID": "506343925.jpg#2"}
{"gold_label": "entailment", "sentence1": {"original": ["Four people standing outside of a convenience store."]}, "sentence2": {"original": ["The people are outside of a store."], "negation": ["The people are not outside of a store.", "The people aren't outside of a store."], "past progressive": ["The people were being outside of a store."], "past simple": ["The people were outside of a store."], "present progressive": ["The people are being outside of a store."], "present simple": ["The people are outside of a store."], "future progressive": ["The people will be being outside of a store."], "future simple": ["The people will be outside of a store."], "modality: may": ["The people may be outside of a store."], "it cleft: ARG1": ["It is the people who are outside of a store.", "It is the people which are outside of a store.", "It is the people that are outside of a store."], "native": ["The people are outside of a store."], "swap subj/obj": ["A store is outside of the people."], "negation+it cleft: ARG1": ["It is not the people who are outside of a store.", "It is not the people which are outside of a store.", "It is not the people that are outside of a store."], "past progressive+it cleft: ARG1": ["It is the people who were being outside of a store.", "It is the people which were being outside of a store.", "It is the people that were being outside of a store."], "past simple+it cleft: ARG1": ["It is the people who were outside of a store.", "It is the people which were outside of a store.", "It is the people that were outside of a store."], "present progressive+it cleft: ARG1": ["It is the people who are being outside of a store.", "It is the people which are being outside of a store.", "It is the people that are being outside of a store."], "present simple+it cleft: ARG1": ["It is the people who are outside of a store.", "It is the people which are outside of a store.", "It is the people that are outside of a store."], "future progressive+it cleft: ARG1": ["It is the people who will be being outside of a store.", "It is the people which will be being outside of a store.", "It is the people that will be being outside of a store."], "future simple+it cleft: ARG1": ["It is the people who will be outside of a store.", "It is the people which will be outside of a store.", "It is the people that will be outside of a store."], "swap subj/obj+it cleft: ARG1": ["It is a store who is outside of the people.", "It is a store which is outside of the people.", "It is a store that is outside of the people."]}, "pairID": "4862273608.jpg#3r1e", "captionID": "4862273608.jpg#3"}
{"gold_label": "contradiction", "sentence1": {"original": ["Young boy wearing waders standing on a dock fishing, other people are in the background."]}, "sentence2": {"original": ["The boy is flying a kite and playing the tuba."]}, "pairID": "1350811702.jpg#0r1c", "captionID": "1350811702.jpg#0"}
{"gold_label": "contradiction", "sentence1": {"original": ["Young boy wearing waders standing on a dock fishing, other people are in the background."]}, "sentence2": "A young boy is water skiing.", "pairID": "1350811702.jpg#0r3c", "captionID": "1350811702.jpg#0"}
{"gold_label": "neutral", "sentence1": {"original": ["Young boy wearing waders standing on a dock fishing, other people are in the background."]}, "sentence2": {"original": ["The crowd watches the boy fish."], "negation": ["The crowd does not watch the boy fish.", "The crowd doesn't watch the boy fish.", "The crowd don't watch the boy fish."], "past progressive": ["The crowd were watching the boy fish.", "The crowd was watching the boy fish."], "past simple": ["The crowd watched the boy fish."], "present progressive": ["The crowd is watching the boy fish.", "The crowd are watching the boy fish."], "present simple": ["The crowd watches the boy fish.", "The crowd watch the boy fish."], "future progressive": ["The crowd will be watching the boy fish."], "future simple": ["The crowd will watch the boy fish."], "modality: may": ["The crowd may watch the boy fish."], "it cleft: ARG1": ["It is the crowd who watches the boy fish.", "It is the crowd which watches the boy fish.", "It is the crowd that watches the boy fish."], "it cleft: ARG2": ["It is the boy fish who are watched by the crowd.", "It is the boy fish which are watched by the crowd.", "It is the boy fish that are watched by the crowd."], "passive: ARG2": ["The boy fish are watched by the crowd."], "native": ["The crowd watches the boy fish.", "The crowd watch the boy fish."], "swap subj/obj": ["The boy fish watch the crowd."], "negation+it cleft: ARG1": ["It is not the crowd who does watch the boy fish.", "It is not the crowd which does watch the boy fish.", "It is not the crowd that does watch the boy fish.", "It is not the crowd who watches the boy fish.", "It is not the crowd which watches the boy fish.", "It is not the crowd that watches the boy fish."], "negation+it cleft: ARG2": ["It is not the boy fish who are watched by the crowd.", "It is not the boy fish which are watched by the crowd.", "It is not the boy fish that are watched by the crowd."], "negation+passive: ARG2": ["The boy fish are not watched by the crowd.", "The boy fish aren't watched by the crowd."], "past progressive+it cleft: ARG1": ["It is the crowd who was watching the boy fish.", "It is the crowd which was watching the boy fish.", "It is the crowd that was watching the boy fish."], "past progressive+it cleft: ARG2": ["It is the boy fish who were being watched by the crowd.", "It is the boy fish which were being watched by the crowd.", "It is the boy fish that were being watched by the crowd."], "past progressive+passive: ARG2": ["The boy fish were being watched by the crowd."], "past simple+it cleft: ARG1": ["It is the crowd who watched the boy fish.", "It is the crowd which watched the boy fish.", "It is the crowd that watched the boy fish."], "past simple+it cleft: ARG2": ["It is the boy fish who were watched by the crowd.", "It is the boy fish which were watched by the crowd.", "It is the boy fish that were watched by the crowd."], "past simple+passive: ARG2": ["The boy fish were watched by the crowd."], "present progressive+it cleft: ARG1": ["It is the crowd who is watching the boy fish.", "It is the crowd which is watching the boy fish.", "It is the crowd that is watching the boy fish."], "present progressive+it cleft: ARG2": ["It is the boy fish who are being watched by the crowd.", "It is the boy fish which are being watched by the crowd.", "It is the boy fish that are being watched by the crowd."], "present progressive+passive: ARG2": ["The boy fish are being watched by the crowd."], "present simple+it cleft: ARG1": ["It is the crowd who watches the boy fish.", "It is the crowd which watches the boy fish.", "It is the crowd that watches the boy fish."], "present simple+it cleft: ARG2": ["It is the boy fish who are watched by the crowd.", "It is the boy fish which are watched by the crowd.", "It is the boy fish that are watched by the crowd."], "present simple+passive: ARG2": ["The boy fish are watched by the crowd."], "future progressive+it cleft: ARG1": ["It is the crowd who will be watching the boy fish.", "It is the crowd which will be watching the boy fish.", "It is the crowd that will be watching the boy fish."], "future progressive+it cleft: ARG2": ["It is the boy fish who will be being watched by the crowd.", "It is the boy fish which will be being watched by the crowd.", "It is the boy fish that will be being watched by the crowd."], "future progressive+passive: ARG2": ["The boy fish will be being watched by the crowd."], "future simple+it cleft: ARG1": ["It is the crowd who will watch the boy fish.", "It is the crowd which will watch the boy fish.", "It is the crowd that will watch the boy fish."], "future simple+it cleft: ARG2": ["It is the boy fish who will be watched by the crowd.", "It is the boy fish which will be watched by the crowd.", "It is the boy fish that will be watched by the crowd."], "future simple+passive: ARG2": ["The boy fish will be watched by the crowd."], "it cleft: ARG1+passive: ARG2": ["It is the crowd who the boy fish are watched by.", "It is the crowd which the boy fish are watched by.", "It is the crowd that the boy fish are watched by.", "It is the crowd by which the boy fish are watched.", "It is the crowd by who the boy fish are watched.", "It is the crowd the boy fish are watched by."], "swap subj/obj+it cleft: ARG1": ["It is the boy fish who watch the crowd.", "It is the boy fish which watch the crowd.", "It is the boy fish that watch the crowd."], "swap subj/obj+it cleft: ARG2": ["It is the crowd who is watched by the boy fish.", "It is the crowd which is watched by the boy fish.", "It is the crowd that is watched by the boy fish."], "swap subj/obj+passive: ARG2": ["The crowd is watched by the boy fish."]}, "pairID": "1350811702.jpg#0r5n", "captionID": "1350811702.jpg#0"}
{"gold_label": "entailment", "sentence1": "A man and woman standing on a sidewalk looking put out.", "sentence2": "There are two people standing on a street.", "pairID": "4801153502.jpg#2r1e", "captionID": "4801153502.jpg#2"}
{"gold_label": "neutral", "sentence1": "A teenager is sitting behind a cardboard box smiling at the camera.", "sentence2": {"original": ["The person is hiding from someone."], "negation": ["The person is not hiding from somebody.", "The person is not hiding from someone.", "The person isn't hiding from somebody.", "The person isn't hiding from someone."], "past progressive": ["The person was hiding from somebody.", "The person was hiding from someone."], "past simple": ["The person hid from somebody.", "The person hid from someone."], "present progressive": ["The person is hiding from somebody.", "The person is hiding from someone."], "present simple": ["The person hides from somebody.", "The person hides from someone."], "future progressive": ["The person will be hiding from somebody.", "The person will be hiding from someone."], "future simple": ["The person will hide from somebody.", "The person will hide from someone."], "modality: may": ["The person may be hiding from somebody.", "The person may be hiding from someone."], "it cleft: ARG1": ["It is the person who is hiding from somebody.", "It is the person who is hiding from someone.", "It is the person which is hiding from somebody.", "It is the person which is hiding from someone.", "It is the person that is hiding from somebody.", "It is the person that is hiding from someone."], "native": ["The person is hiding from somebody.", "The person is hiding from someone."], "negation+it cleft: ARG1": ["It is not the person who is hiding from somebody.", "It is not the person who is hiding from someone.", "It is not the person which is hiding from somebody.", "It is not the person which is hiding from someone.", "It is not the person that is hiding from somebody.", "It is not the person that is hiding from someone."], "past progressive+it cleft: ARG1": ["It is the person who was hiding from somebody.", "It is the person who was hiding from someone.", "It is the person which was hiding from somebody.", "It is the person which was hiding from someone.", "It is the person that was hiding from somebody.", "It is the person that was hiding from someone."], "past simple+it cleft: ARG1": ["It is the person who hid from somebody.", "It is the person who hid from someone.", "It is the person which hid from somebody.", "It is the person which hid from someone.", "It is the person that hid from somebody.", "It is the person that hid from someone."], "present progressive+it cleft: ARG1": ["It is the person who is hiding from somebody.", "It is the person who is hiding from someone.", "It is the person which is hiding from somebody.", "It is the person which is hiding from someone.", "It is the person that is hiding from somebody.", "It is the person that is hiding from someone."], "present simple+it cleft: ARG1": ["It is the person who hides from somebody.", "It is the person who hides from someone.", "It is the person which hides from somebody.", "It is the person which hides from someone.", "It is the person that hides from somebody.", "It is the person that hides from someone."], "future progressive+it cleft: ARG1": ["It is the person who will be hiding from somebody.", "It is the person who will be hiding from someone.", "It is the person which will be hiding from somebody.", "It is the person which will be hiding from someone.", "It is the person that will be hiding from somebody.", "It is the person that will be hiding from someone."], "future simple+it cleft: ARG1": ["It is the person who will hide from somebody.", "It is the person who will hide from someone.", "It is the person which will hide from somebody.", "It is the person which will hide from someone.", "It is the person that will hide from somebody.", "It is the person that will hide from someone."]}, "pairID": "508751871.jpg#1r1n", "captionID": "508751871.jpg#1"}
{"gold_label": "contradiction", "sentence1": "A teenager is sitting behind a cardboard box smiling at the camera.", "sentence2": {"original": ["The elderly man is hiding behind the box."], "negation": ["The elderly man is not hiding behind the box.", "The elderly man isn't hiding behind the box."], "past progressive": ["The elderly man was hiding behind the box."], "past simple": ["The elderly man hid behind the box."], "present progressive": ["The elderly man is hiding behind the box."], "present simple": ["The elderly man hides behind the box."], "future progressive": ["The elderly man will be hiding behind the box."], "future simple": ["The elderly man will hide behind the box."], "modality: may": ["The elderly man may be hiding behind the box."], "it cleft: ARG1": ["It is the elderly man who is hiding behind the box.", "It is the elderly man which is hiding behind the box.", "It is the elderly man that is hiding behind the box."], "native": ["The elderly man is hiding behind the box."], "negation+it cleft: ARG1": ["It is not the elderly man who is hiding behind the box.", "It is not the elderly man which is hiding behind the box.", "It is not the elderly man that is hiding behind the box."], "past progressive+it cleft: ARG1": ["It is the elderly man who was hiding behind the box.", "It is the elderly man which was hiding behind the box.", "It is the elderly man that was hiding behind the box."], "past simple+it cleft: ARG1": ["It is the elderly man who hid behind the box.", "It is the elderly man which hid behind the box.", "It is the elderly man that hid behind the box."], "present progressive+it cleft: ARG1": ["It is the elderly man who is hiding behind the box.", "It is the elderly man which is hiding behind the box.", "It is the elderly man that is hiding behind the box."], "present simple+it cleft: ARG1": ["It is the elderly man who hides behind the box.", "It is the elderly man which hides behind the box.", "It is the elderly man that hides behind the box."], "future progressive+it cleft: ARG1": ["It is the elderly man who will be hiding behind the box.", "It is the elderly man which will be hiding behind the box.", "It is the elderly man that will be hiding behind the box."], "future simple+it cleft: ARG1": ["It is the elderly man who will hide behind the box.", "It is the elderly man which will hide behind the box.", "It is the elderly man that will hide behind the box."]}, "pairID": "508751871.jpg#1r1c", "captionID": "508751871.jpg#1"}
{"gold_label": "contradiction", "sentence1": {"original": ["A woman mixing together a batter of food."]}, "sentence2": {"original": ["The woman is sewing a dress."], "negation": ["The woman is not sewing a dress.", "The woman isn't sewing a dress."], "past progressive": ["The woman was sewing a dress."], "past simple": ["The woman sewed a dress."], "present progressive": ["The woman is sewing a dress."], "present simple": ["The woman sews a dress."], "future progressive": ["The woman will be sewing a dress."], "future simple": ["The woman will sew a dress."], "modality: may": ["The woman may be sewing a dress."], "it cleft: ARG1": ["It is the woman who is sewing a dress.", "It is the woman which is sewing a dress.", "It is the woman that is sewing a dress."], "it cleft: ARG2": ["It is a dress who is being sewed by the woman.", "It is a dress which is being sewed by the woman.", "It is a dress that is being sewed by the woman."], "passive: ARG2": ["A dress is being sewed by the woman."], "native": ["The woman is sewing a dress."], "swap subj/obj": ["A dress is sewing the woman."], "negation+it cleft: ARG1": ["It is not the woman who is sewing a dress.", "It is not the woman which is sewing a dress.", "It is not the woman that is sewing a dress."], "negation+it cleft: ARG2": ["It is not a dress who is being sewed by the woman.", "It is not a dress which is being sewed by the woman.", "It is not a dress that is being sewed by the woman."], "negation+passive: ARG2": ["A dress is not being sewed by the woman.", "A dress isn't being sewed by the woman.", "A dress is being not sewed by the woman."], "past progressive+it cleft: ARG1": ["It is the woman who was sewing a dress.", "It is the woman which was sewing a dress.", "It is the woman that was sewing a dress."], "past progressive+it cleft: ARG2": ["It is a dress who was being sewed by the woman.", "It is a dress which was being sewed by the woman.", "It is a dress that was being sewed by the woman."], "past progressive+passive: ARG2": ["A dress was being sewed by the woman."], "past simple+it cleft: ARG1": ["It is the woman who sewed a dress.", "It is the woman which sewed a dress.", "It is the woman that sewed a dress."], "past simple+it cleft: ARG2": ["It is a dress who was sewed by the woman.", "It is a dress which was sewed by the woman.", "It is a dress that was sewed by the woman."], "past simple+passive: ARG2": ["A dress was sewed by the woman."], "present progressive+it cleft: ARG1": ["It is the woman who is sewing a dress.", "It is the woman which is sewing a dress.", "It is the woman that is sewing a dress."], "present progressive+it cleft: ARG2": ["It is a dress who is being sewed by the woman.", "It is a dress which is being sewed by the woman.", "It is a dress that is being sewed by the woman."], "present progressive+passive: ARG2": ["A dress is being sewed by the woman."], "present simple+it cleft: ARG1": ["It is the woman who sews a dress.", "It is the woman which sews a dress.", "It is the woman that sews a dress."], "present simple+it cleft: ARG2": ["It is a dress who is sewed by the woman.", "It is a dress which is sewed by the woman.", "It is a dress that is sewed by the woman."], "present simple+passive: ARG2": ["A dress is sewed by the woman."], "future progressive+it cleft: ARG1": ["It is the woman who will be sewing a dress.", "It is the woman which will be sewing a dress.", "It is the woman that will be sewing a dress."], "future progressive+it cleft: ARG2": ["It is a dress who will be being sewed by the woman.", "It is a dress which will be being sewed by the woman.", "It is a dress that will be being sewed by the woman."], "future progressive+passive: ARG2": ["A dress will be being sewed by the woman."], "future simple+it cleft: ARG1": ["It is the woman who will sew a dress.", "It is the woman which will sew a dress.", "It is the woman that will sew a dress."], "future simple+it cleft: ARG2": ["It is a dress who will be sewed by the woman.", "It is a dress which will be sewed by the woman.", "It is a dress that will be sewed by the woman."], "future simple+passive: ARG2": ["A dress will be sewed by the woman."], "it cleft: ARG1+passive: ARG2": ["It is the woman who a dress is being sewed by.", "It is the woman which a dress is being sewed by.", "It is the woman that a dress is being sewed by.", "It is the woman by which a dress is being sewed.", "It is the woman by who a dress is being sewed.", "It is the woman a dress is being sewed by."], "swap subj/obj+it cleft: ARG1": ["It is a dress who is sewing the woman.", "It is a dress which is sewing the woman.", "It is a dress that is sewing the woman."], "swap subj/obj+it cleft: ARG2": ["It is the woman who is being sewed by a dress.", "It is the woman which is being sewed by a dress.", "It is the woman that is being sewed by a dress."], "swap subj/obj+passive: ARG2": ["The woman is being sewed by a dress."]}, "pairID": "5559471351.jpg#4r1c", "captionID": "5559471351.jpg#4"}
{"gold_label": "entailment", "sentence1": "People sit by a fountain, a guy with purple hair talks to a guy in a hat.", "sentence2": "There is a guy.", "pairID": "872512911.jpg#2r1e", "captionID": "872512911.jpg#2"}
{"gold_label": "contradiction", "sentence1": "People sit by a fountain, a guy with purple hair talks to a guy in a hat.", "sentence2": {"original": ["The guy has red hair."], "negation": ["The guy does not have red hair.", "The guy doesn't have red hair."], "past progressive": ["The guy was having red hair."], "past simple": ["The guy had red hair."], "present progressive": ["The guy is having red hair."], "present simple": ["The guy has red hair."], "future progressive": ["The guy will be having red hair."], "future simple": ["The guy will have red hair."], "modality: may": ["The guy may have red hair."], "it cleft: ARG1": ["It is the guy who has red hair.", "It is the guy which has red hair.", "It is the guy that has red hair."], "native": ["The guy has red hair."], "swap subj/obj": ["Red hair has the guy."], "negation+it cleft: ARG1": ["It is not the guy who has red hair.", "It is not the guy which has red hair.", "It is not the guy that has red hair.", "It is not the guy who does have red hair.", "It is not the guy which does have red hair.", "It is not the guy that does have red hair."], "past progressive+it cleft: ARG1": ["It is the guy who was having red hair.", "It is the guy which was having red hair.", "It is the guy that was having red hair."], "past simple+it cleft: ARG1": ["It is the guy who had red hair.", "It is the guy which had red hair.", "It is the guy that had red hair."], "present progressive+it cleft: ARG1": ["It is the guy who is having red hair.", "It is the guy which is having red hair.", "It is the guy that is having red hair."], "present simple+it cleft: ARG1": ["It is the guy who has red hair.", "It is the guy which has red hair.", "It is the guy that has red hair."], "future progressive+it cleft: ARG1": ["It is the guy who will be having red hair.", "It is the guy which will be having red hair.", "It is the guy that will be having red hair."], "future simple+it cleft: ARG1": ["It is the guy who will have red hair.", "It is the guy which will have red hair.", "It is the guy that will have red hair."], "swap subj/obj+it cleft: ARG1": ["It is red hair who has the guy.", "It is red hair which has the guy.", "It is red hair that has the guy."]}, "pairID": "872512911.jpg#2r1c", "captionID": "872512911.jpg#2"}
{"gold_label": "contradiction", "sentence1": {"original": ["A man dressed in black tunes a black electric guitar."], "negation": ["No man dressed in black tunes a black electric guitar.", "No man dressed in black tunes an electric black guitar."], "past progressive": ["A man dressed in black was tuning a black electric guitar.", "A man dressed in black was tuning an electric black guitar."], "past simple": ["A man dressed in black tuned a black electric guitar.", "A man dressed in black tuned an electric black guitar."], "present progressive": ["A man dressed in black is tuning a black electric guitar.", "A man dressed in black is tuning an electric black guitar."], "present simple": ["A man dressed in black tunes a black electric guitar.", "A man dressed in black tunes an electric black guitar."], "future progressive": ["A man dressed in black will be tuning a black electric guitar.", "A man dressed in black will be tuning an electric black guitar."], "future simple": ["A man dressed in black will tune a black electric guitar.", "A man dressed in black will tune an electric black guitar."], "modality: may": ["A man dressed in black may tune a black electric guitar.", "A man dressed in black may tune an electric black guitar."], "it cleft: ARG1": ["It is a man dressed in black who tunes a black electric guitar.", "It is a man dressed in black which tunes a black electric guitar.", "It is a man dressed in black that tunes a black electric guitar.", "It is a man dressed in black who tunes an electric black guitar.", "It is a man dressed in black which tunes an electric black guitar.", "It is a man dressed in black that tunes an electric black guitar."], "it cleft: ARG2": ["It is an electric black guitar who is tuned by a man dressed in black.", "It is an electric black guitar which is tuned by a man dressed in black.", "It is an electric black guitar that is tuned by a man dressed in black.", "It is a black electric guitar who is tuned by a man dressed in black.", "It is a black electric guitar which is tuned by a man dressed in black.", "It is a black electric guitar that is tuned by a man dressed in black."], "passive: ARG2": ["An electric black guitar is tuned by a man dressed in black.", "A black electric guitar is tuned by a man dressed in black."], "native": ["A man dressed in black tunes a black electric guitar.", "A man dressed in black tunes an electric black guitar."], "swap subj/obj": ["An electric black guitar tunes a man dressed in black.", "A black electric guitar tunes a man dressed in black."], "negation+it cleft: ARG1": ["It is no man dressed in black who tunes a black electric guitar.", "It is no man dressed in black which tunes a black electric guitar.", "It is no man dressed in black that tunes a black electric guitar.", "It is no man dressed in black who tunes an electric black guitar.", "It is no man dressed in black which tunes an electric black guitar.", "It is no man dressed in black that tunes an electric black guitar."], "negation+it cleft: ARG2": ["It is an electric black guitar who is tuned by no man dressed in black.", "It is an electric black guitar which is tuned by no man dressed in black.", "It is an electric black guitar that is tuned by no man dressed in black.", "It is a black electric guitar who is tuned by no man dressed in black.", "It is a black electric guitar which is tuned by no man dressed in black.", "It is a black electric guitar that is tuned by no man dressed in black."], "negation+passive: ARG2": ["An electric black guitar is tuned by no man dressed in black.", "A black electric guitar is tuned by no man dressed in black."], "past progressive+it cleft: ARG1": ["It is a man dressed in black who was tuning a black electric guitar.", "It is a man dressed in black which was tuning a black electric guitar.", "It is a man dressed in black that was tuning a black electric guitar.", "It is a man dressed in black who was tuning an electric black guitar.", "It is a man dressed in black which was tuning an electric black guitar.", "It is a man dressed in black that was tuning an electric black guitar."], "past progressive+it cleft: ARG2": ["It is an electric black guitar who was being tuned by a man dressed in black.", "It is an electric black guitar which was being tuned by a man dressed in black.", "It is an electric black guitar that was being tuned by a man dressed in black.", "It is a black electric guitar who was being tuned by a man dressed in black.", "It is a black electric guitar which was being tuned by a man dressed in black.", "It is a black electric guitar that was being tuned by a man dressed in black."], "past progressive+passive: ARG2": ["An electric black guitar was being tuned by a man dressed in black.", "A black electric guitar was being tuned by a man dressed in black."], "past simple+it cleft: ARG1": ["It is a man dressed in black who tuned a black electric guitar.", "It is a man dressed in black which tuned a black electric guitar.", "It is a man dressed in black that tuned a black electric guitar.", "It is a man dressed in black who tuned an electric black guitar.", "It is a man dressed in black which tuned an electric black guitar.", "It is a man dressed in black that tuned an electric black guitar."], "past simple+it cleft: ARG2": ["It is an electric black guitar who was tuned by a man dressed in black.", "It is an electric black guitar which was tuned by a man dressed in black.", "It is an electric black guitar that was tuned by a man dressed in black.", "It is a black electric guitar who was tuned by a man dressed in black.", "It is a black electric guitar which was tuned by a man dressed in black.", "It is a black electric guitar that was tuned by a man dressed in black."], "past simple+passive: ARG2": ["An electric black guitar was tuned by a man dressed in black.", "A black electric guitar was tuned by a man dressed in black."], "present progressive+it cleft: ARG1": ["It is a man dressed in black who is tuning a black electric guitar.", "It is a man dressed in black which is tuning a black electric guitar.", "It is a man dressed in black that is tuning a black electric guitar.", "It is a man dressed in black who is tuning an electric black guitar.", "It is a man dressed in black which is tuning an electric black guitar.", "It is a man dressed in black that is tuning an electric black guitar."], "present progressive+it cleft: ARG2": ["It is an electric black guitar who is being tuned by a man dressed in black.", "It is an electric black guitar which is being tuned by a man dressed in black.", "It is an electric black guitar that is being tuned by a man dressed in black.", "It is a black electric guitar who is being tuned by a man dressed in black.", "It is a black electric guitar which is being tuned by a man dressed in black.", "It is a black electric guitar that is being tuned by a man dressed in black."], "present progressive+passive: ARG2": ["An electric black guitar is being tuned by a man dressed in black.", "A black electric guitar is being tuned by a man dressed in black."], "present simple+it cleft: ARG1": ["It is a man dressed in black who tunes a black electric guitar.", "It is a man dressed in black which tunes a black electric guitar.", "It is a man dressed in black that tunes a black electric guitar.", "It is a man dressed in black who tunes an electric black guitar.", "It is a man dressed in black which tunes an electric black guitar.", "It is a man dressed in black that tunes an electric black guitar."], "present simple+it cleft: ARG2": ["It is an electric black guitar who is tuned by a man dressed in black.", "It is an electric black guitar which is tuned by a man dressed in black.", "It is an electric black guitar that is tuned by a man dressed in black.", "It is a black electric guitar who is tuned by a man dressed in black.", "It is a black electric guitar which is tuned by a man dressed in black.", "It is a black electric guitar that is tuned by a man dressed in black."], "present simple+passive: ARG2": ["An electric black guitar is tuned by a man dressed in black.", "A black electric guitar is tuned by a man dressed in black."], "future progressive+it cleft: ARG1": ["It is a man dressed in black who will be tuning a black electric guitar.", "It is a man dressed in black which will be tuning a black electric guitar.", "It is a man dressed in black that will be tuning a black electric guitar.", "It is a man dressed in black who will be tuning an electric black guitar.", "It is a man dressed in black which will be tuning an electric black guitar.", "It is a man dressed in black that will be tuning an electric black guitar."], "future progressive+it cleft: ARG2": ["It is an electric black guitar who will be being tuned by a man dressed in black.", "It is an electric black guitar which will be being tuned by a man dressed in black.", "It is an electric black guitar that will be being tuned by a man dressed in black.", "It is a black electric guitar who will be being tuned by a man dressed in black.", "It is a black electric guitar which will be being tuned by a man dressed in black.", "It is a black electric guitar that will be being tuned by a man dressed in black."], "future progressive+passive: ARG2": ["An electric black guitar will be being tuned by a man dressed in black.", "A black electric guitar will be being tuned by a man dressed in black."], "future simple+it cleft: ARG1": ["It is a man dressed in black who will tune a black electric guitar.", "It is a man dressed in black which will tune a black electric guitar.", "It is a man dressed in black that will tune a black electric guitar.", "It is a man dressed in black who will tune an electric black guitar.", "It is a man dressed in black which will tune an electric black guitar.", "It is a man dressed in black that will tune an electric black guitar."], "future simple+it cleft: ARG2": ["It is an electric black guitar who will be tuned by a man dressed in black.", "It is an electric black guitar which will be tuned by a man dressed in black.", "It is an electric black guitar that will be tuned by a man dressed in black.", "It is a black electric guitar who will be tuned by a man dressed in black.", "It is a black electric guitar which will be tuned by a man dressed in black.", "It is a black electric guitar that will be tuned by a man dressed in black."], "future simple+passive: ARG2": ["An electric black guitar will be tuned by a man dressed in black.", "A black electric guitar will be tuned by a man dressed in black."], "it cleft: ARG1+passive: ARG2": ["It is a man dressed in black who a black electric guitar is tuned by.", "It is a man dressed in black which a black electric guitar is tuned by.", "It is a man dressed in black that a black electric guitar is tuned by.", "It is a man dressed in black who an electric black guitar is tuned by.", "It is a man dressed in black which an electric black guitar is tuned by.", "It is a man dressed in black that an electric black guitar is tuned by.", "It is a man dressed in black by which a black electric guitar is tuned.", "It is a man dressed in black by which an electric black guitar is tuned.", "It is a man dressed in black by who a black electric guitar is tuned.", "It is a man dressed in black by who an electric black guitar is tuned.", "It is a man dressed in black a black electric guitar is tuned by.", "It is a man dressed in black an electric black guitar is tuned by."], "swap subj/obj+it cleft: ARG1": ["It is an electric black guitar who tunes a man dressed in black.", "It is an electric black guitar which tunes a man dressed in black.", "It is an electric black guitar that tunes a man dressed in black.", "It is a black electric guitar who tunes a man dressed in black.", "It is a black electric guitar which tunes a man dressed in black.", "It is a black electric guitar that tunes a man dressed in black."], "swap subj/obj+it cleft: ARG2": ["It is a man dressed in black who is tuned by a black electric guitar.", "It is a man dressed in black which is tuned by a black electric guitar.", "It is a man dressed in black that is tuned by a black electric guitar.", "It is a man dressed in black who is tuned by an electric black guitar.", "It is a man dressed in black which is tuned by an electric black guitar.", "It is a man dressed in black that is tuned by an electric black guitar."], "swap subj/obj+passive: ARG2": ["A man dressed in black is tuned by a black electric guitar.", "A man dressed in black is tuned by an electric black guitar."]}, "sentence2": {"original": ["A man plays his guitar for friends."], "negation": ["No man plays his guitar for friends."], "past progressive": ["A man was playing his guitar for friends."], "past simple": ["A man played his guitar for friends."], "present progressive": ["A man is playing his guitar for friends."], "present simple": ["A man plays his guitar for friends."], "future progressive": ["A man will be playing his guitar for friends."], "future simple": ["A man will play his guitar for friends."], "modality: may": ["A man may play his guitar for friends."], "it cleft: ARG1": ["It is a man who plays his guitar for friends.", "It is a man which plays his guitar for friends.", "It is a man that plays his guitar for friends."], "it cleft: ARG2": ["It is his guitar who is played by a man for friends.", "It is his guitar which is played by a man for friends.", "It is his guitar that is played by a man for friends."], "passive: ARG2": ["His guitar is played by a man for friends."], "native": ["A man plays his guitar for friends."], "swap subj/obj": ["His guitar plays a man for friends."], "negation+it cleft: ARG1": ["It is no man who plays his guitar for friends.", "It is no man which plays his guitar for friends.", "It is no man that plays his guitar for friends."], "negation+it cleft: ARG2": ["It is his guitar who is played by no man for friends.", "It is his guitar which is played by no man for friends.", "It is his guitar that is played by no man for friends."], "negation+passive: ARG2": ["His guitar is played by no man for friends."], "past progressive+it cleft: ARG1": ["It is a man who was playing his guitar for friends.", "It is a man which was playing his guitar for friends.", "It is a man that was playing his guitar for friends."], "past progressive+it cleft: ARG2": ["It is his guitar who was being played by a man for friends.", "It is his guitar which was being played by a man for friends.", "It is his guitar that was being played by a man for friends."], "past progressive+passive: ARG2": ["His guitar was being played by a man for friends."], "past simple+it cleft: ARG1": ["It is a man who played his guitar for friends.", "It is a man which played his guitar for friends.", "It is a man that played his guitar for friends."], "past simple+it cleft: ARG2": ["It is his guitar who was played by a man for friends.", "It is his guitar which was played by a man for friends.", "It is his guitar that was played by a man for friends."], "past simple+passive: ARG2": ["His guitar was played by a man for friends."], "present progressive+it cleft: ARG1": ["It is a man who is playing his guitar for friends.", "It is a man which is playing his guitar for friends.", "It is a man that is playing his guitar for friends."], "present progressive+it cleft: ARG2": ["It is his guitar who is being played by a man for friends.", "It is his guitar which is being played by a man for friends.", "It is his guitar that is being played by a man for friends."], "present progressive+passive: ARG2": ["His guitar is being played by a man for friends."], "present simple+it cleft: ARG1": ["It is a man who plays his guitar for friends.", "It is a man which plays his guitar for friends.", "It is a man that plays his guitar for friends."], "present simple+it cleft: ARG2": ["It is his guitar who is played by a man for friends.", "It is his guitar which is played by a man for friends.", "It is his guitar that is played by a man for friends."], "present simple+passive: ARG2": ["His guitar is played by a man for friends."], "future progressive+it cleft: ARG1": ["It is a man who will be playing his guitar for friends.", "It is a man which will be playing his guitar for friends.", "It is a man that will be playing his guitar for friends."], "future progressive+it cleft: ARG2": ["It is his guitar who will be being played by a man for friends.", "It is his guitar which will be being played by a man for friends.", "It is his guitar that will be being played by a man for friends."], "future progressive+passive: ARG2": ["His guitar will be being played by a man for friends."], "future simple+it cleft: ARG1": ["It is a man who will play his guitar for friends.", "It is a man which will play his guitar for friends.", "It is a man that will play his guitar for friends."], "future simple+it cleft: ARG2": ["It is his guitar who will be played by a man for friends.", "It is his guitar which will be played by a man for friends.", "It is his guitar that will be played by a man for friends."], "future simple+passive: ARG2": ["His guitar will be played by a man for friends."], "it cleft: ARG1+passive: ARG2": ["It is a man who his guitar is played by for friends.", "It is a man which his guitar is played by for friends.", "It is a man that his guitar is played by for friends.", "It is a man by which his guitar is played for friends.", "It is a man by who his guitar is played for friends.", "It is a man his guitar is played by for friends."], "swap subj/obj+it cleft: ARG1": ["It is his guitar who plays a man for friends.", "It is his guitar which plays a man for friends.", "It is his guitar that plays a man for friends."], "swap subj/obj+it cleft: ARG2": ["It is a man who is played by his guitar for friends.", "It is a man which is played by his guitar for friends.", "It is a man that is played by his guitar for friends."], "swap subj/obj+passive: ARG2": ["A man is played by his guitar for friends."]}, "pairID": "3027458414.jpg#0r1c", "captionID": "3027458414.jpg#0"}
{"gold_label": "entailment", "sentence1": {"original": ["A man dressed in black tunes a black electric guitar."], "negation": ["No man dressed in black tunes a black electric guitar.", "No man dressed in black tunes an electric black guitar."], "past progressive": ["A man dressed in black was tuning a black electric guitar.", "A man dressed in black was tuning an electric black guitar."], "past simple": ["A man dressed in black tuned a black electric guitar.", "A man dressed in black tuned an electric black guitar."], "present progressive": ["A man dressed in black is tuning a black electric guitar.", "A man dressed in black is tuning an electric black guitar."], "present simple": ["A man dressed in black tunes a black electric guitar.", "A man dressed in black tunes an electric black guitar."], "future progressive": ["A man dressed in black will be tuning a black electric guitar.", "A man dressed in black will be tuning an electric black guitar."], "future simple": ["A man dressed in black will tune a black electric guitar.", "A man dressed in black will tune an electric black guitar."], "modality: may": ["A man dressed in black may tune a black electric guitar.", "A man dressed in black may tune an electric black guitar."], "it cleft: ARG1": ["It is a man dressed in black who tunes a black electric guitar.", "It is a man dressed in black which tunes a black electric guitar.", "It is a man dressed in black that tunes a black electric guitar.", "It is a man dressed in black who tunes an electric black guitar.", "It is a man dressed in black which tunes an electric black guitar.", "It is a man dressed in black that tunes an electric black guitar."], "it cleft: ARG2": ["It is an electric black guitar who is tuned by a man dressed in black.", "It is an electric black guitar which is tuned by a man dressed in black.", "It is an electric black guitar that is tuned by a man dressed in black.", "It is a black electric guitar who is tuned by a man dressed in black.", "It is a black electric guitar which is tuned by a man dressed in black.", "It is a black electric guitar that is tuned by a man dressed in black."], "passive: ARG2": ["An electric black guitar is tuned by a man dressed in black.", "A black electric guitar is tuned by a man dressed in black."], "native": ["A man dressed in black tunes a black electric guitar.", "A man dressed in black tunes an electric black guitar."], "swap subj/obj": ["An electric black guitar tunes a man dressed in black.", "A black electric guitar tunes a man dressed in black."], "negation+it cleft: ARG1": ["It is no man dressed in black who tunes a black electric guitar.", "It is no man dressed in black which tunes a black electric guitar.", "It is no man dressed in black that tunes a black electric guitar.", "It is no man dressed in black who tunes an electric black guitar.", "It is no man dressed in black which tunes an electric black guitar.", "It is no man dressed in black that tunes an electric black guitar."], "negation+it cleft: ARG2": ["It is an electric black guitar who is tuned by no man dressed in black.", "It is an electric black guitar which is tuned by no man dressed in black.", "It is an electric black guitar that is tuned by no man dressed in black.", "It is a black electric guitar who is tuned by no man dressed in black.", "It is a black electric guitar which is tuned by no man dressed in black.", "It is a black electric guitar that is tuned by no man dressed in black."], "negation+passive: ARG2": ["An electric black guitar is tuned by no man dressed in black.", "A black electric guitar is tuned by no man dressed in black."], "past progressive+it cleft: ARG1": ["It is a man dressed in black who was tuning a black electric guitar.", "It is a man dressed in black which was tuning a black electric guitar.", "It is a man dressed in black that was tuning a black electric guitar.", "It is a man dressed in black who was tuning an electric black guitar.", "It is a man dressed in black which was tuning an electric black guitar.", "It is a man dressed in black that was tuning an electric black guitar."], "past progressive+it cleft: ARG2": ["It is an electric black guitar who was being tuned by a man dressed in black.", "It is an electric black guitar which was being tuned by a man dressed in black.", "It is an electric black guitar that was being tuned by a man dressed in black.", "It is a black electric guitar who was being tuned by a man dressed in black.", "It is a black electric guitar which was being tuned by a man dressed in black.", "It is a black electric guitar that was being tuned by a man dressed in black."], "past progressive+passive: ARG2": ["An electric black guitar was being tuned by a man dressed in black.", "A black electric guitar was being tuned by a man dressed in black."], "past simple+it cleft: ARG1": ["It is a man dressed in black who tuned a black electric guitar.", "It is a man dressed in black which tuned a black electric guitar.", "It is a man dressed in black that tuned a black electric guitar.", "It is a man dressed in black who tuned an electric black guitar.", "It is a man dressed in black which tuned an electric black guitar.", "It is a man dressed in black that tuned an electric black guitar."], "past simple+it cleft: ARG2": ["It is an electric black guitar who was tuned by a man dressed in black.", "It is an electric black guitar which was tuned by a man dressed in black.", "It is an electric black guitar that was tuned by a man dressed in black.", "It is a black electric guitar who was tuned by a man dressed in black.", "It is a black electric guitar which was tuned by a man dressed in black.", "It is a black electric guitar that was tuned by a man dressed in black."], "past simple+passive: ARG2": ["An electric black guitar was tuned by a man dressed in black.", "A black electric guitar was tuned by a man dressed in black."], "present progressive+it cleft: ARG1": ["It is a man dressed in black who is tuning a black electric guitar.", "It is a man dressed in black which is tuning a black electric guitar.", "It is a man dressed in black that is tuning a black electric guitar.", "It is a man dressed in black who is tuning an electric black guitar.", "It is a man dressed in black which is tuning an electric black guitar.", "It is a man dressed in black that is tuning an electric black guitar."], "present progressive+it cleft: ARG2": ["It is an electric black guitar who is being tuned by a man dressed in black.", "It is an electric black guitar which is being tuned by a man dressed in black.", "It is an electric black guitar that is being tuned by a man dressed in black.", "It is a black electric guitar who is being tuned by a man dressed in black.", "It is a black electric guitar which is being tuned by a man dressed in black.", "It is a black electric guitar that is being tuned by a man dressed in black."], "present progressive+passive: ARG2": ["An electric black guitar is being tuned by a man dressed in black.", "A black electric guitar is being tuned by a man dressed in black."], "present simple+it cleft: ARG1": ["It is a man dressed in black who tunes a black electric guitar.", "It is a man dressed in black which tunes a black electric guitar.", "It is a man dressed in black that tunes a black electric guitar.", "It is a man dressed in black who tunes an electric black guitar.", "It is a man dressed in black which tunes an electric black guitar.", "It is a man dressed in black that tunes an electric black guitar."], "present simple+it cleft: ARG2": ["It is an electric black guitar who is tuned by a man dressed in black.", "It is an electric black guitar which is tuned by a man dressed in black.", "It is an electric black guitar that is tuned by a man dressed in black.", "It is a black electric guitar who is tuned by a man dressed in black.", "It is a black electric guitar which is tuned by a man dressed in black.", "It is a black electric guitar that is tuned by a man dressed in black."], "present simple+passive: ARG2": ["An electric black guitar is tuned by a man dressed in black.", "A black electric guitar is tuned by a man dressed in black."], "future progressive+it cleft: ARG1": ["It is a man dressed in black who will be tuning a black electric guitar.", "It is a man dressed in black which will be tuning a black electric guitar.", "It is a man dressed in black that will be tuning a black electric guitar.", "It is a man dressed in black who will be tuning an electric black guitar.", "It is a man dressed in black which will be tuning an electric black guitar.", "It is a man dressed in black that will be tuning an electric black guitar."], "future progressive+it cleft: ARG2": ["It is an electric black guitar who will be being tuned by a man dressed in black.", "It is an electric black guitar which will be being tuned by a man dressed in black.", "It is an electric black guitar that will be being tuned by a man dressed in black.", "It is a black electric guitar who will be being tuned by a man dressed in black.", "It is a black electric guitar which will be being tuned by a man dressed in black.", "It is a black electric guitar that will be being tuned by a man dressed in black."], "future progressive+passive: ARG2": ["An electric black guitar will be being tuned by a man dressed in black.", "A black electric guitar will be being tuned by a man dressed in black."], "future simple+it cleft: ARG1": ["It is a man dressed in black who will tune a black electric guitar.", "It is a man dressed in black which will tune a black electric guitar.", "It is a man dressed in black that will tune a black electric guitar.", "It is a man dressed in black who will tune an electric black guitar.", "It is a man dressed in black which will tune an electric black guitar.", "It is a man dressed in black that will tune an electric black guitar."], "future simple+it cleft: ARG2": ["It is an electric black guitar who will be tuned by a man dressed in black.", "It is an electric black guitar which will be tuned by a man dressed in black.", "It is an electric black guitar that will be tuned by a man dressed in black.", "It is a black electric guitar who will be tuned by a man dressed in black.", "It is a black electric guitar which will be tuned by a man dressed in black.", "It is a black electric guitar that will be tuned by a man dressed in black."], "future simple+passive: ARG2": ["An electric black guitar will be tuned by a man dressed in black.", "A black electric guitar will be tuned by a man dressed in black."], "it cleft: ARG1+passive: ARG2": ["It is a man dressed in black who a black electric guitar is tuned by.", "It is a man dressed in black which a black electric guitar is tuned by.", "It is a man dressed in black that a black electric guitar is tuned by.", "It is a man dressed in black who an electric black guitar is tuned by.", "It is a man dressed in black which an electric black guitar is tuned by.", "It is a man dressed in black that an electric black guitar is tuned by.", "It is a man dressed in black by which a black electric guitar is tuned.", "It is a man dressed in black by which an electric black guitar is tuned.", "It is a man dressed in black by who a black electric guitar is tuned.", "It is a man dressed in black by who an electric black guitar is tuned.", "It is a man dressed in black a black electric guitar is tuned by.", "It is a man dressed in black an electric black guitar is tuned by."], "swap subj/obj+it cleft: ARG1": ["It is an electric black guitar who tunes a man dressed in black.", "It is an electric black guitar which tunes a man dressed in black.", "It is an electric black guitar that tunes a man dressed in black.", "It is a black electric guitar who tunes a man dressed in black.", "It is a black electric guitar which tunes a man dressed in black.", "It is a black electric guitar that tunes a man dressed in black."], "swap subj/obj+it cleft: ARG2": ["It is a man dressed in black who is tuned by a black electric guitar.", "It is a man dressed in black which is tuned by a black electric guitar.", "It is a man dressed in black that is tuned by a black electric guitar.", "It is a man dressed in black who is tuned by an electric black guitar.", "It is a man dressed in black which is tuned by an electric black guitar.", "It is a man dressed in black that is tuned by an electric black guitar."], "swap subj/obj+passive: ARG2": ["A man dressed in black is tuned by a black electric guitar.", "A man dressed in black is tuned by an electric black guitar."]}, "sentence2": {"original": ["A man tunes a guitar."], "negation": ["No man tunes a guitar."], "past progressive": ["A man was tuning a guitar."], "past simple": ["A man tuned a guitar."], "present progressive": ["A man is tuning a guitar."], "present simple": ["A man tunes a guitar."], "future progressive": ["A man will be tuning a guitar."], "future simple": ["A man will tune a guitar."], "modality: may": ["A man may tune a guitar."], "it cleft: ARG1": ["It is a man who tunes a guitar.", "It is a man which tunes a guitar.", "It is a man that tunes a guitar."], "it cleft: ARG2": ["It is a guitar who is tuned by a man.", "It is a guitar which is tuned by a man.", "It is a guitar that is tuned by a man."], "passive: ARG2": ["A guitar is tuned by a man."], "native": ["A man tunes a guitar."], "swap subj/obj": ["A guitar tunes a man."], "negation+it cleft: ARG1": ["It is no man who tunes a guitar.", "It is no man which tunes a guitar.", "It is no man that tunes a guitar."], "negation+it cleft: ARG2": ["It is a guitar who is tuned by no man.", "It is a guitar which is tuned by no man.", "It is a guitar that is tuned by no man."], "negation+passive: ARG2": ["A guitar is tuned by no man."], "past progressive+it cleft: ARG1": ["It is a man who was tuning a guitar.", "It is a man which was tuning a guitar.", "It is a man that was tuning a guitar."], "past progressive+it cleft: ARG2": ["It is a guitar who was being tuned by a man.", "It is a guitar which was being tuned by a man.", "It is a guitar that was being tuned by a man."], "past progressive+passive: ARG2": ["A guitar was being tuned by a man."], "past simple+it cleft: ARG1": ["It is a man who tuned a guitar.", "It is a man which tuned a guitar.", "It is a man that tuned a guitar."], "past simple+it cleft: ARG2": ["It is a guitar who was tuned by a man.", "It is a guitar which was tuned by a man.", "It is a guitar that was tuned by a man."], "past simple+passive: ARG2": ["A guitar was tuned by a man."], "present progressive+it cleft: ARG1": ["It is a man who is tuning a guitar.", "It is a man which is tuning a guitar.", "It is a man that is tuning a guitar."], "present progressive+it cleft: ARG2": ["It is a guitar who is being tuned by a man.", "It is a guitar which is being tuned by a man.", "It is a guitar that is being tuned by a man."], "present progressive+passive: ARG2": ["A guitar is being tuned by a man."], "present simple+it cleft: ARG1": ["It is a man who tunes a guitar.", "It is a man which tunes a guitar.", "It is a man that tunes a guitar."], "present simple+it cleft: ARG2": ["It is a guitar who is tuned by a man.", "It is a guitar which is tuned by a man.", "It is a guitar that is tuned by a man."], "present simple+passive: ARG2": ["A guitar is tuned by a man."], "future progressive+it cleft: ARG1": ["It is a man who will be tuning a guitar.", "It is a man which will be tuning a guitar.", "It is a man that will be tuning a guitar."], "future progressive+it cleft: ARG2": ["It is a guitar who will be being tuned by a man.", "It is a guitar which will be being tuned by a man.", "It is a guitar that will be being tuned by a man."], "future progressive+passive: ARG2": ["A guitar will be being tuned by a man."], "future simple+it cleft: ARG1": ["It is a man who will tune a guitar.", "It is a man which will tune a guitar.", "It is a man that will tune a guitar."], "future simple+it cleft: ARG2": ["It is a guitar who will be tuned by a man.", "It is a guitar which will be tuned by a man.", "It is a guitar that will be tuned by a man."], "future simple+passive: ARG2": ["A guitar will be tuned by a man."], "it cleft: ARG1+passive: ARG2": ["It is a man who a guitar is tuned by.", "It is a man which a guitar is tuned by.", "It is a man that a guitar is tuned by.", "It is a man by which a guitar is tuned.", "It is a man by who a guitar is tuned.", "It is a man a guitar is tuned by."], "swap subj/obj+it cleft: ARG1": ["It is a guitar who tunes a man.", "It is a guitar which tunes a man.", "It is a guitar that tunes a man."], "swap subj/obj+it cleft: ARG2": ["It is a man who is tuned by a guitar.", "It is a man which is tuned by a guitar.", "It is a man that is tuned by a guitar."], "swap subj/obj+passive: ARG2": ["A man is tuned by a guitar."]}, "pairID": "3027458414.jpg#0r1e", "captionID": "3027458414.jpg#0"}
{"gold_label": "contradiction", "sentence1": {"original": ["A young girl is wearing a bathing suit and the ocean is behind her."]}, "sentence2": {"original": ["A young girl is not wearing a bathing suit"], "past progressive": ["A young girl was not wearing a bathing suit.", "A young girl wasn't wearing a bathing suit."], "past simple": ["A young girl did not wear a bathing suit.", "A young girl didn't wear a bathing suit."], "present progressive": ["A young girl is not wearing a bathing suit.", "A young girl isn't wearing a bathing suit."], "present simple": ["A young girl does not wear a bathing suit.", "A young girl doesn't wear a bathing suit."], "future progressive": ["A young girl will not be wearing a bathing suit.", "A young girl will be not wearing a bathing suit.", "A young girl won't be wearing a bathing suit."], "future simple": ["A young girl will not wear a bathing suit.", "A young girl won't wear a bathing suit."], "modality: may": ["A young girl may not be wearing a bathing suit."], "it cleft: ARG1": ["It is not a young girl who is wearing a bathing suit.", "It is not a young girl which is wearing a bathing suit.", "It is not a young girl that is wearing a bathing suit."], "it cleft: ARG2": ["It is not a bathing suit who is being worn by a young girl.", "It is not a bathing suit which is being worn by a young girl.", "It is not a bathing suit that is being worn by a young girl."], "passive: ARG2": ["A bathing suit is not being worn by a young girl.", "A bathing suit isn't being worn by a young girl.", "A bathing suit is being not worn by a young girl."], "native": ["A young girl is not wearing a bathing suit.", "A young girl isn't wearing a bathing suit."], "swap subj/obj": ["A bathing suit is not wearing a young girl.", "A bathing suit isn't wearing a young girl."], "past progressive+it cleft: ARG1": ["It is not a young girl who was wearing a bathing suit.", "It is not a young girl which was wearing a bathing suit.", "It is not a young girl that was wearing a bathing suit."], "past progressive+it cleft: ARG2": ["It is not a bathing suit who was being worn by a young girl.", "It is not a bathing suit which was being worn by a young girl.", "It is not a bathing suit that was being worn by a young girl."], "past progressive+passive: ARG2": ["A bathing suit was not being worn by a young girl.", "A bathing suit wasn't being worn by a young girl.", "A bathing suit was being not worn by a young girl."], "past simple+it cleft: ARG1": ["It is not a young girl who wore a bathing suit.", "It is not a young girl which wore a bathing suit.", "It is not a young girl who did wear a bathing suit.", "It is not a young girl that wore a bathing suit.", "It is not a young girl which did wear a bathing suit.", "It is not a young girl that did wear a bathing suit."], "past simple+it cleft: ARG2": ["It is not a bathing suit who was worn by a young girl.", "It is not a bathing suit which was worn by a young girl.", "It is not a bathing suit that was worn by a young girl."], "past simple+passive: ARG2": ["A bathing suit was not worn by a young girl.", "A bathing suit wasn't worn by a young girl."], "present progressive+it cleft: ARG1": ["It is not a young girl who is wearing a bathing suit.", "It is not a young girl which is wearing a bathing suit.", "It is not a young girl that is wearing a bathing suit."], "present progressive+it cleft: ARG2": ["It is not a bathing suit who is being worn by a young girl.", "It is not a bathing suit which is being worn by a young girl.", "It is not a bathing suit that is being worn by a young girl."], "present progressive+passive: ARG2": ["A bathing suit is not being worn by a young girl.", "A bathing suit isn't being worn by a young girl.", "A bathing suit is being not worn by a young girl."], "present simple+it cleft: ARG1": ["It is not a young girl who does wear a bathing suit.", "It is not a young girl which does wear a bathing suit.", "It is not a young girl that does wear a bathing suit.", "It is not a young girl who wears a bathing suit.", "It is not a young girl which wears a bathing suit.", "It is not a young girl that wears a bathing suit."], "present simple+it cleft: ARG2": ["It is not a bathing suit who is worn by a young girl.", "It is not a bathing suit which is worn by a young girl.", "It is not a bathing suit that is worn by a young girl."], "present simple+passive: ARG2": ["A bathing suit is not worn by a young girl.", "A bathing suit isn't worn by a young girl."], "future progressive+it cleft: ARG1": ["It is not a young girl who will be wearing a bathing suit.", "It is not a young girl which will be wearing a bathing suit.", "It is not a young girl that will be wearing a bathing suit."], "future progressive+it cleft: ARG2": ["It is not a bathing suit who will be being worn by a young girl.", "It is not a bathing suit which will be being worn by a young girl.", "It is not a bathing suit that will be being worn by a young girl."], "future progressive+passive: ARG2": ["A bathing suit will not be being worn by a young girl.", "A bathing suit won't be being worn by a young girl.", "A bathing suit will be not being worn by a young girl.", "A bathing suit will be being not worn by a young girl."], "future simple+it cleft: ARG1": ["It is not a young girl who will wear a bathing suit.", "It is not a young girl which will wear a bathing suit.", "It is not a young girl that will wear a bathing suit."], "future simple+it cleft: ARG2": ["It is not a bathing suit who will be worn by a young girl.", "It is not a bathing suit which will be worn by a young girl.", "It is not a bathing suit that will be worn by a young girl."], "future simple+passive: ARG2": ["A bathing suit will not be worn by a young girl.", "A bathing suit won't be worn by a young girl.", "A bathing suit will be not worn by a young girl."], "it cleft: ARG1+passive: ARG2": ["It is not a young girl who a bathing suit is being worn by.", "It is not a young girl which a bathing suit is being worn by.", "It is not a young girl that a bathing suit is being worn by.", "It is not a young girl by which a bathing suit is being worn.", "It is not a young girl by who a bathing suit is being worn.", "It is not a young girl a bathing suit is being worn by."], "swap subj/obj+it cleft: ARG1": ["It is not a bathing suit who is wearing a young girl.", "It is not a bathing suit which is wearing a young girl.", "It is not a bathing suit that is wearing a young girl."], "swap subj/obj+it cleft: ARG2": ["It is not a young girl who is being worn by a bathing suit.", "It is not a young girl which is being worn by a bathing suit.", "It is not a young girl that is being worn by a bathing suit."], "swap subj/obj+passive: ARG2": ["A young girl is not being worn by a bathing suit.", "A young girl isn't being worn by a bathing suit.", "A young girl is being not worn by a bathing suit."]}, "pairID": "2140305708.jpg#1r1c", "captionID": "2140305708.jpg#1"}
{"gold_label": "entailment", "sentence1": {"original": ["A woman standing outside at dawn."]}, "sentence2": "A woman is standing outside.", "pairID": "434039163.jpg#4r1e", "captionID": "434039163.jpg#4"}
{"gold_label": "neutral", "sentence1": {"original": ["A child in red short and orange cap in a parking lot."]}, "sentence2": "The child is cold.", "pairID": "2828583747.jpg#3r1n", "captionID": "2828583747.jpg#3"}
{"gold_label": "contradiction", "sentence1": {"original": ["A child in red short and orange cap in a parking lot."]}, "sentence2": {"original": ["The child is in sweatpants."]}, "pairID": "2828583747.jpg#3r1c", "captionID": "2828583747.jpg#3"}
{"gold_label": "contradiction", "sentence1": {"original": ["Workers constructing a temporary structure."]}, "sentence2": {"original": ["The men are eating lunch."], "negation": ["The men are not eating lunch.", "The men aren't eating lunch."], "past progressive": ["The men were eating lunch."], "past simple": ["The men ate lunch."], "present progressive": ["The men are eating lunch."], "present simple": ["The men eat lunch."], "future progressive": ["The men will be eating lunch."], "future simple": ["The men will eat lunch."], "modality: may": ["The men may be eating lunch."], "it cleft: ARG1": ["It is the men who are eating lunch.", "It is the men which are eating lunch.", "It is the men that are eating lunch."], "it cleft: ARG2": ["It is lunch who is being eaten by the men.", "It is lunch which is being eaten by the men.", "It is lunch that is being eaten by the men."], "passive: ARG2": ["Lunch is being eaten by the men."], "native": ["The men are eating lunch."], "swap subj/obj": ["Lunch is eating the men."], "negation+it cleft: ARG1": ["It is not the men who are eating lunch.", "It is not the men which are eating lunch.", "It is not the men that are eating lunch."], "negation+it cleft: ARG2": ["It is not lunch who is being eaten by the men.", "It is not lunch which is being eaten by the men.", "It is not lunch that is being eaten by the men."], "negation+passive: ARG2": ["Lunch is not being eaten by the men.", "Lunch isn't being eaten by the men.", "Lunch is being not eaten by the men."], "past progressive+it cleft: ARG1": ["It is the men who were eating lunch.", "It is the men which were eating lunch.", "It is the men that were eating lunch."], "past progressive+it cleft: ARG2": ["It is lunch who was being eaten by the men.", "It is lunch which was being eaten by the men.", "It is lunch that was being eaten by the men."], "past progressive+passive: ARG2": ["Lunch was being eaten by the men."], "past simple+it cleft: ARG1": ["It is the men who ate lunch.", "It is the men which ate lunch.", "It is the men that ate lunch."], "past simple+it cleft: ARG2": ["It is lunch who was eaten by the men.", "It is lunch which was eaten by the men.", "It is lunch that was eaten by the men."], "past simple+passive: ARG2": ["Lunch was eaten by the men."], "present progressive+it cleft: ARG1": ["It is the men who are eating lunch.", "It is the men which are eating lunch.", "It is the men that are eating lunch."], "present progressive+it cleft: ARG2": ["It is lunch who is being eaten by the men.", "It is lunch which is being eaten by the men.", "It is lunch that is being eaten by the men."], "present progressive+passive: ARG2": ["Lunch is being eaten by the men."], "present simple+it cleft: ARG1": ["It is the men who eat lunch.", "It is the men which eat lunch.", "It is the men that eat lunch."], "present simple+it cleft: ARG2": ["It is lunch who is eaten by the men.", "It is lunch which is eaten by the men.", "It is lunch that is eaten by the men."], "present simple+passive: ARG2": ["Lunch is eaten by the men."], "future progressive+it cleft: ARG1": ["It is the men who will be eating lunch.", "It is the men which will be eating lunch.", "It is the men that will be eating lunch."], "future progressive+it cleft: ARG2": ["It is lunch who will be being eaten by the men.", "It is lunch which will be being eaten by the men.", "It is lunch that will be being eaten by the men."], "future progressive+passive: ARG2": ["Lunch will be being eaten by the men."], "future simple+it cleft: ARG1": ["It is the men who will eat lunch.", "It is the men which will eat lunch.", "It is the men that will eat lunch."], "future simple+it cleft: ARG2": ["It is lunch who will be eaten by the men.", "It is lunch which will be eaten by the men.", "It is lunch that will be eaten by the men."], "future simple+passive: ARG2": ["Lunch will be eaten by the men."], "it cleft: ARG1+passive: ARG2": ["It is the men who lunch is being eaten by.", "It is the men which lunch is being eaten by.", "It is the men that lunch is being eaten by.", "It is the men by which lunch is being eaten.", "It is the men by who lunch is being eaten.", "It is the men lunch is being eaten by."], "swap subj/obj+it cleft: ARG1": ["It is lunch who is eating the men.", "It is lunch which is eating the men.", "It is lunch that is eating the men."], "swap subj/obj+it cleft: ARG2": ["It is the men who are being eaten by lunch.", "It is the men which are being eaten by lunch.", "It is the men that are being eaten by lunch."], "swap subj/obj+passive: ARG2": ["The men are being eaten by lunch."]}, "pairID": "76605444.jpg#3r4c", "captionID": "76605444.jpg#3"}
{"gold_label": "neutral", "sentence1": {"original": ["Workers constructing a temporary structure."]}, "sentence2": {"original": ["The workers are building a hut."], "negation": ["The workers are not building a hut.", "The workers aren't building a hut."], "past progressive": ["The workers were building a hut."], "past simple": ["The workers built a hut."], "present progressive": ["The workers are building a hut."], "present simple": ["The workers build a hut."], "future progressive": ["The workers will be building a hut."], "future simple": ["The workers will build a hut."], "modality: may": ["The workers may be building a hut."], "it cleft: ARG1": ["It is the workers who are building a hut.", "It is the workers which are building a hut.", "It is the workers that are building a hut."], "it cleft: ARG2": ["It is a hut who is being built by the workers.", "It is a hut which is being built by the workers.", "It is a hut that is being built by the workers."], "passive: ARG2": ["A hut is being built by the workers."], "native": ["The workers are building a hut."], "swap subj/obj": ["A hut is building the workers."], "negation+it cleft: ARG1": ["It is not the workers who are building a hut.", "It is not the workers which are building a hut.", "It is not the workers that are building a hut."], "negation+it cleft: ARG2": ["It is not a hut who is being built by the workers.", "It is not a hut which is being built by the workers.", "It is not a hut that is being built by the workers."], "negation+passive: ARG2": ["A hut is not being built by the workers.", "A hut isn't being built by the workers.", "A hut is being not built by the workers."], "past progressive+it cleft: ARG1": ["It is the workers who were building a hut.", "It is the workers which were building a hut.", "It is the workers that were building a hut."], "past progressive+it cleft: ARG2": ["It is a hut who was being built by the workers.", "It is a hut which was being built by the workers.", "It is a hut that was being built by the workers."], "past progressive+passive: ARG2": ["A hut was being built by the workers."], "past simple+it cleft: ARG1": ["It is the workers who built a hut.", "It is the workers which built a hut.", "It is the workers that built a hut."], "past simple+it cleft: ARG2": ["It is a hut who was built by the workers.", "It is a hut which was built by the workers.", "It is a hut that was built by the workers."], "past simple+passive: ARG2": ["A hut was built by the workers."], "present progressive+it cleft: ARG1": ["It is the workers who are building a hut.", "It is the workers which are building a hut.", "It is the workers that are building a hut."], "present progressive+it cleft: ARG2": ["It is a hut who is being built by the workers.", "It is a hut which is being built by the workers.", "It is a hut that is being built by the workers."], "present progressive+passive: ARG2": ["A hut is being built by the workers."], "present simple+it cleft: ARG1": ["It is the workers who build a hut.", "It is the workers which build a hut.", "It is the workers that build a hut."], "present simple+it cleft: ARG2": ["It is a hut who is built by the workers.", "It is a hut which is built by the workers.", "It is a hut that is built by the workers."], "present simple+passive: ARG2": ["A hut is built by the workers."], "future progressive+it cleft: ARG1": ["It is the workers who will be building a hut.", "It is the workers which will be building a hut.", "It is the workers that will be building a hut."], "future progressive+it cleft: ARG2": ["It is a hut who will be being built by the workers.", "It is a hut which will be being built by the workers.", "It is a hut that will be being built by the workers."], "future progressive+passive: ARG2": ["A hut will be being built by the workers."], "future simple+it cleft: ARG1": ["It is the workers who will build a hut.", "It is the workers which will build a hut.", "It is the workers that will build a hut."], "future simple+it cleft: ARG2": ["It is a hut who will be built by the workers.", "It is a hut which will be built by the workers.", "It is a hut that will be built by the workers."], "future simple+passive: ARG2": ["A hut will be built by the workers."], "it cleft: ARG1+passive: ARG2": ["It is the workers who a hut is being built by.", "It is the workers which a hut is being built by.", "It is the workers that a hut is being built by.", "It is the workers by which a hut is being built.", "It is the workers by who a hut is being built.", "It is the workers a hut is being built by."], "swap subj/obj+it cleft: ARG1": ["It is a hut who is building the workers.", "It is a hut which is building the workers.", "It is a hut that is building the workers."], "swap subj/obj+it cleft: ARG2": ["It is the workers who are being built by a hut.", "It is the workers which are being built by a hut.", "It is the workers that are being built by a hut."], "swap subj/obj+passive: ARG2": ["The workers are being built by a hut."]}, "pairID": "76605444.jpg#3r3n", "captionID": "76605444.jpg#3"}
{"gold_label": "neutral", "sentence1": {"original": ["Workers constructing a temporary structure."]}, "sentence2": {"original": ["The workers are creating shed."], "negation": ["Shed, the workers are not creating.", "Shed, the workers aren't creating.", "The workers are not creating shed.", "The workers aren't creating shed."], "past progressive": ["Shed, the workers were creating.", "The workers were creating shed."], "past simple": ["Shed, the workers created.", "The workers created shed."], "present progressive": ["Shed, the workers are creating.", "The workers are creating shed."], "present simple": ["The workers create shed.", "Shed, the workers create."], "future progressive": ["Shed, the workers will be creating.", "The workers will be creating shed."], "future simple": ["Shed, the workers will create.", "The workers will create shed."], "modality: may": ["Shed, the workers may be creating.", "The workers may be creating shed."], "it cleft: ARG1": ["Shed, it is the workers who are creating.", "Shed, it is the workers which are creating.", "Shed, it is the workers that are creating.", "It is the workers which are creating shed.", "It is the workers that are creating shed.", "It is the workers who are creating shed."], "native": ["Shed, the workers are creating.", "The workers are creating shed."], "negation+it cleft: ARG1": ["Shed, it is not the workers who are creating.", "Shed, it is not the workers which are creating.", "Shed, it is not the workers that are creating.", "It is not the workers which are creating shed.", "It is not the workers that are creating shed.", "It is not the workers who are creating shed."], "past progressive+it cleft: ARG1": ["Shed, it is the workers who were creating.", "Shed, it is the workers which were creating.", "Shed, it is the workers that were creating.", "It is the workers which were creating shed.", "It is the workers that were creating shed.", "It is the workers who were creating shed."], "past simple+it cleft: ARG1": ["Shed, it is the workers who created.", "Shed, it is the workers which created.", "Shed, it is the workers that created.", "It is the workers which created shed.", "It is the workers that created shed.", "It is the workers who created shed."], "present progressive+it cleft: ARG1": ["Shed, it is the workers who are creating.", "Shed, it is the workers which are creating.", "Shed, it is the workers that are creating.", "It is the workers which are creating shed.", "It is the workers that are creating shed.", "It is the workers who are creating shed."], "present simple+it cleft: ARG1": ["Shed, it is the workers who create.", "Shed, it is the workers which create.", "Shed, it is the workers that create.", "It is the workers which create shed.", "It is the workers that create shed.", "It is the workers who create shed."], "future progressive+it cleft: ARG1": ["Shed, it is the workers who will be creating.", "Shed, it is the workers which will be creating.", "Shed, it is the workers that will be creating.", "It is the workers which will be creating shed.", "It is the workers that will be creating shed.", "It is the workers who will be creating shed."], "future simple+it cleft: ARG1": ["Shed, it is the workers who will create.", "Shed, it is the workers which will create.", "Shed, it is the workers that will create.", "It is the workers which will create shed.", "It is the workers that will create shed.", "It is the workers who will create shed."]}, "pairID": "76605444.jpg#3r1n", "captionID": "76605444.jpg#3"}
{"gold_label": "entailment", "sentence1": "A young man in a blue shirt is sitting on a couch with a few more people having his hand in front of his mouth.", "sentence2": "A group of people is sitting on a couch inside.", "pairID": "2514667945.jpg#0r1e", "captionID": "2514667945.jpg#0"}
{"gold_label": "neutral", "sentence1": {"original": ["The little boy is having a grand time at the water park."], "negation": ["The little boy is not having a grand time at the water park.", "The little boy isn't having a grand time at the water park."], "past progressive": ["The little boy was having a grand time at the water park."], "past simple": ["The little boy had a grand time at the water park."], "present progressive": ["The little boy is having a grand time at the water park."], "present simple": ["The little boy has a grand time at the water park."], "future progressive": ["The little boy will be having a grand time at the water park."], "future simple": ["The little boy will have a grand time at the water park."], "modality: may": ["The little boy may be having a grand time at the water park."], "it cleft: ARG1": ["It is the little boy who is having a grand time at the water park.", "It is the little boy which is having a grand time at the water park.", "It is the little boy that is having a grand time at the water park."], "native": ["The little boy is having a grand time at the water park."], "swap subj/obj": ["A grand time at the water park is having the little boy."], "negation+it cleft: ARG1": ["It is not the little boy who is having a grand time at the water park.", "It is not the little boy which is having a grand time at the water park.", "It is not the little boy that is having a grand time at the water park."], "past progressive+it cleft: ARG1": ["It is the little boy who was having a grand time at the water park.", "It is the little boy which was having a grand time at the water park.", "It is the little boy that was having a grand time at the water park."], "past simple+it cleft: ARG1": ["It is the little boy who had a grand time at the water park.", "It is the little boy which had a grand time at the water park.", "It is the little boy that had a grand time at the water park."], "present progressive+it cleft: ARG1": ["It is the little boy who is having a grand time at the water park.", "It is the little boy which is having a grand time at the water park.", "It is the little boy that is having a grand time at the water park."], "present simple+it cleft: ARG1": ["It is the little boy who has a grand time at the water park.", "It is the little boy which has a grand time at the water park.", "It is the little boy that has a grand time at the water park."], "future progressive+it cleft: ARG1": ["It is the little boy who will be having a grand time at the water park.", "It is the little boy which will be having a grand time at the water park.", "It is the little boy that will be having a grand time at the water park."], "future simple+it cleft: ARG1": ["It is the little boy who will have a grand time at the water park.", "It is the little boy which will have a grand time at the water park.", "It is the little boy that will have a grand time at the water park."], "swap subj/obj+it cleft: ARG1": ["It is a grand time at the water park which is having the little boy.", "It is a grand time at the water park that is having the little boy."]}, "sentence2": "A boy is going down a water slide.", "pairID": "3496411891.jpg#2r1n", "captionID": "3496411891.jpg#2"}
{"gold_label": "entailment", "sentence1": {"original": ["The little boy is having a grand time at the water park."], "negation": ["The little boy is not having a grand time at the water park.", "The little boy isn't having a grand time at the water park."], "past progressive": ["The little boy was having a grand time at the water park."], "past simple": ["The little boy had a grand time at the water park."], "present progressive": ["The little boy is having a grand time at the water park."], "present simple": ["The little boy has a grand time at the water park."], "future progressive": ["The little boy will be having a grand time at the water park."], "future simple": ["The little boy will have a grand time at the water park."], "modality: may": ["The little boy may be having a grand time at the water park."], "it cleft: ARG1": ["It is the little boy who is having a grand time at the water park.", "It is the little boy which is having a grand time at the water park.", "It is the little boy that is having a grand time at the water park."], "native": ["The little boy is having a grand time at the water park."], "swap subj/obj": ["A grand time at the water park is having the little boy."], "negation+it cleft: ARG1": ["It is not the little boy who is having a grand time at the water park.", "It is not the little boy which is having a grand time at the water park.", "It is not the little boy that is having a grand time at the water park."], "past progressive+it cleft: ARG1": ["It is the little boy who was having a grand time at the water park.", "It is the little boy which was having a grand time at the water park.", "It is the little boy that was having a grand time at the water park."], "past simple+it cleft: ARG1": ["It is the little boy who had a grand time at the water park.", "It is the little boy which had a grand time at the water park.", "It is the little boy that had a grand time at the water park."], "present progressive+it cleft: ARG1": ["It is the little boy who is having a grand time at the water park.", "It is the little boy which is having a grand time at the water park.", "It is the little boy that is having a grand time at the water park."], "present simple+it cleft: ARG1": ["It is the little boy who has a grand time at the water park.", "It is the little boy which has a grand time at the water park.", "It is the little boy that has a grand time at the water park."], "future progressive+it cleft: ARG1": ["It is the little boy who will be having a grand time at the water park.", "It is the little boy which will be having a grand time at the water park.", "It is the little boy that will be having a grand time at the water park."], "future simple+it cleft: ARG1": ["It is the little boy who will have a grand time at the water park.", "It is the little boy which will have a grand time at the water park.", "It is the little boy that will have a grand time at the water park."], "swap subj/obj+it cleft: ARG1": ["It is a grand time at the water park which is having the little boy.", "It is a grand time at the water park that is having the little boy."]}, "sentence2": {"original": ["A boy is at a water park."], "negation": ["No boy is at a water park."], "past progressive": ["A boy was being at a water park."], "past simple": ["A boy was at a water park."], "present progressive": ["A boy is being at a water park."], "present simple": ["A boy is at a water park."], "future progressive": ["A boy will be being at a water park."], "future simple": ["A boy will be at a water park."], "modality: may": ["A boy may be at a water park."], "it cleft: ARG1": ["It is a boy who is at a water park.", "It is a boy which is at a water park.", "It is a boy that is at a water park."], "native": ["A boy is at a water park."], "swap subj/obj": ["A water park is at a boy."], "negation+it cleft: ARG1": ["It is no boy who is at a water park.", "It is no boy which is at a water park.", "It is no boy that is at a water park."], "past progressive+it cleft: ARG1": ["It is a boy who was being at a water park.", "It is a boy which was being at a water park.", "It is a boy that was being at a water park."], "past simple+it cleft: ARG1": ["It is a boy who was at a water park.", "It is a boy which was at a water park.", "It is a boy that was at a water park."], "present progressive+it cleft: ARG1": ["It is a boy who is being at a water park.", "It is a boy which is being at a water park.", "It is a boy that is being at a water park."], "present simple+it cleft: ARG1": ["It is a boy who is at a water park.", "It is a boy which is at a water park.", "It is a boy that is at a water park."], "future progressive+it cleft: ARG1": ["It is a boy who will be being at a water park.", "It is a boy which will be being at a water park.", "It is a boy that will be being at a water park."], "future simple+it cleft: ARG1": ["It is a boy who will be at a water park.", "It is a boy which will be at a water park.", "It is a boy that will be at a water park."], "swap subj/obj+it cleft: ARG1": ["It is a water park who is at a boy.", "It is a water park which is at a boy.", "It is a water park that is at a boy."]}, "pairID": "3496411891.jpg#2r1e", "captionID": "3496411891.jpg#2"}
{"gold_label": "entailment", "sentence1": {"original": ["A man in a yellow shirt surfing."]}, "sentence2": {"original": ["a surfer wearing yellow"]}, "pairID": "3211316116.jpg#4r1e", "captionID": "3211316116.jpg#4"}
{"gold_label": "neutral", "sentence1": "A man is sitting on a bench with three kids nearby.", "sentence2": {"original": ["The man is the childrens babysitter."]}, "pairID": "53081704.jpg#2r1n", "captionID": "53081704.jpg#2"}
{"gold_label": "contradiction", "sentence1": "A man is sitting on a bench with three kids nearby.", "sentence2": {"original": ["The man is climbing a tree."], "negation": ["The man is not climbing a tree.", "The man isn't climbing a tree."], "past progressive": ["The man was climbing a tree."], "past simple": ["The man climbed a tree."], "present progressive": ["The man is climbing a tree."], "present simple": ["The man climbs a tree."], "future progressive": ["The man will be climbing a tree."], "future simple": ["The man will climb a tree."], "modality: may": ["The man may be climbing a tree."], "it cleft: ARG1": ["It is the man who is climbing a tree.", "It is the man which is climbing a tree.", "It is the man that is climbing a tree."], "it cleft: ARG2": ["It is a tree who is being climbed by the man.", "It is a tree which is being climbed by the man.", "It is a tree that is being climbed by the man."], "passive: ARG2": ["A tree is being climbed by the man."], "native": ["The man is climbing a tree."], "swap subj/obj": ["A tree is climbing the man."], "negation+it cleft: ARG1": ["It is not the man who is climbing a tree.", "It is not the man which is climbing a tree.", "It is not the man that is climbing a tree."], "negation+it cleft: ARG2": ["It is not a tree who is being climbed by the man.", "It is not a tree which is being climbed by the man.", "It is not a tree that is being climbed by the man."], "negation+passive: ARG2": ["A tree is not being climbed by the man.", "A tree is being not climbed by the man.", "A tree isn't being climbed by the man."], "past progressive+it cleft: ARG1": ["It is the man who was climbing a tree.", "It is the man which was climbing a tree.", "It is the man that was climbing a tree."], "past progressive+it cleft: ARG2": ["It is a tree who was being climbed by the man.", "It is a tree which was being climbed by the man.", "It is a tree that was being climbed by the man."], "past progressive+passive: ARG2": ["A tree was being climbed by the man."], "past simple+it cleft: ARG1": ["It is the man who climbed a tree.", "It is the man which climbed a tree.", "It is the man that climbed a tree."], "past simple+it cleft: ARG2": ["It is a tree who was climbed by the man.", "It is a tree which was climbed by the man.", "It is a tree that was climbed by the man."], "past simple+passive: ARG2": ["A tree was climbed by the man."], "present progressive+it cleft: ARG1": ["It is the man who is climbing a tree.", "It is the man which is climbing a tree.", "It is the man that is climbing a tree."], "present progressive+it cleft: ARG2": ["It is a tree who is being climbed by the man.", "It is a tree which is being climbed by the man.", "It is a tree that is being climbed by the man."], "present progressive+passive: ARG2": ["A tree is being climbed by the man."], "present simple+it cleft: ARG1": ["It is the man who climbs a tree.", "It is the man which climbs a tree.", "It is the man that climbs a tree."], "present simple+it cleft: ARG2": ["It is a tree who is climbed by the man.", "It is a tree which is climbed by the man.", "It is a tree that is climbed by the man."], "present simple+passive: ARG2": ["A tree is climbed by the man."], "future progressive+it cleft: ARG1": ["It is the man who will be climbing a tree.", "It is the man which will be climbing a tree.", "It is the man that will be climbing a tree."], "future progressive+it cleft: ARG2": ["It is a tree who will be being climbed by the man.", "It is a tree which will be being climbed by the man.", "It is a tree that will be being climbed by the man."], "future progressive+passive: ARG2": ["A tree will be being climbed by the man."], "future simple+it cleft: ARG1": ["It is the man who will climb a tree.", "It is the man which will climb a tree.", "It is the man that will climb a tree."], "future simple+it cleft: ARG2": ["It is a tree who will be climbed by the man.", "It is a tree which will be climbed by the man.", "It is a tree that will be climbed by the man."], "future simple+passive: ARG2": ["A tree will be climbed by the man."], "it cleft: ARG1+passive: ARG2": ["It is the man who a tree is being climbed by.", "It is the man which a tree is being climbed by.", "It is the man that a tree is being climbed by.", "It is the man by which a tree is being climbed.", "It is the man by who a tree is being climbed.", "It is the man a tree is being climbed by."], "swap subj/obj+it cleft: ARG1": ["It is a tree who is climbing the man.", "It is a tree which is climbing the man.", "It is a tree that is climbing the man."], "swap subj/obj+it cleft: ARG2": ["It is the man who is being climbed by a tree.", "It is the man which is being climbed by a tree.", "It is the man that is being climbed by a tree."], "swap subj/obj+passive: ARG2": ["The man is being climbed by a tree."]}, "pairID": "53081704.jpg#2r1c", "captionID": "53081704.jpg#2"}
{"gold_label": "contradiction", "sentence1": {"original": ["Three children are playing at a sprinkler park."]}, "sentence2": {"original": ["Three men are playing at a sprinkler park."]}, "pairID": "2172493537.jpg#2r1c", "captionID": "2172493537.jpg#2"}
{"gold_label": "neutral", "sentence1": {"original": ["Three children are playing at a sprinkler park."]}, "sentence2": {"original": ["Three sad children are playing at a sprinkler park."]}, "pairID": "2172493537.jpg#2r1n", "captionID": "2172493537.jpg#2"}
{"gold_label": "entailment", "sentence1": {"original": ["Three children are playing at a sprinkler park."]}, "sentence2": {"original": ["Three children are playing at a park."], "negation": ["Three children are not playing at a park.", "Three children aren't playing at a park."], "past progressive": ["Three children were playing at a park."], "past simple": ["Three children played at a park."], "present progressive": ["Three children are playing at a park."], "present simple": ["Three children play at a park."], "future progressive": ["Three children will be playing at a park."], "future simple": ["Three children will play at a park."], "modality: may": ["Three children may be playing at a park."], "it cleft: ARG1": ["It is three children who are playing at a park.", "It is three children which are playing at a park.", "It is three children that are playing at a park."], "native": ["Three children are playing at a park."], "negation+it cleft: ARG1": ["It is not three children who are playing at a park.", "It is not three children which are playing at a park.", "It is not three children that are playing at a park."], "past progressive+it cleft: ARG1": ["It is three children who were playing at a park.", "It is three children which were playing at a park.", "It is three children that were playing at a park."], "past simple+it cleft: ARG1": ["It is three children who played at a park.", "It is three children which played at a park.", "It is three children that played at a park."], "present progressive+it cleft: ARG1": ["It is three children who are playing at a park.", "It is three children which are playing at a park.", "It is three children that are playing at a park."], "present simple+it cleft: ARG1": ["It is three children who play at a park.", "It is three children which play at a park.", "It is three children that play at a park."], "future progressive+it cleft: ARG1": ["It is three children who will be playing at a park.", "It is three children which will be playing at a park.", "It is three children that will be playing at a park."], "future simple+it cleft: ARG1": ["It is three children who will play at a park.", "It is three children which will play at a park.", "It is three children that will play at a park."]}, "pairID": "2172493537.jpg#2r1e", "captionID": "2172493537.jpg#2"}
{"gold_label": "entailment", "sentence1": "A number of children wearing red shirts with white hearts stand outside a bus, watched by two men, receiving toys.", "sentence2": {"original": ["Some children are getting toys."], "negation": ["No child is getting toys."], "past progressive": ["Some children were getting toys."], "past simple": ["Some children got toys."], "present progressive": ["Some children are getting toys."], "present simple": ["Some children get toys."], "future progressive": ["Some children will be getting toys."], "future simple": ["Some children will get toys."], "modality: may": ["Some children may be getting toys."], "it cleft: ARG1": ["It is some children who are getting toys.", "It is some children which are getting toys.", "It is some children that are getting toys."], "native": ["Some children are getting toys."], "swap subj/obj": ["Toys are getting some children."], "negation+it cleft: ARG1": ["It is no child who is getting toys.", "It is no child which is getting toys.", "It is no child that is getting toys."], "past progressive+it cleft: ARG1": ["It is some children who were getting toys.", "It is some children which were getting toys.", "It is some children that were getting toys."], "past simple+it cleft: ARG1": ["It is some children who got toys.", "It is some children which got toys.", "It is some children that got toys."], "present progressive+it cleft: ARG1": ["It is some children who are getting toys.", "It is some children which are getting toys.", "It is some children that are getting toys."], "present simple+it cleft: ARG1": ["It is some children who get toys.", "It is some children which get toys.", "It is some children that get toys."], "future progressive+it cleft: ARG1": ["It is some children who will be getting toys.", "It is some children which will be getting toys.", "It is some children that will be getting toys."], "future simple+it cleft: ARG1": ["It is some children who will get toys.", "It is some children which will get toys.", "It is some children that will get toys."], "swap subj/obj+it cleft: ARG1": ["It is toys who are getting some children.", "It is toys which are getting some children.", "It is toys that are getting some children."]}, "pairID": "1869615544.jpg#1r5e", "captionID": "1869615544.jpg#1"}
{"gold_label": "neutral", "sentence1": "A number of children wearing red shirts with white hearts stand outside a bus, watched by two men, receiving toys.", "sentence2": "A number of children are watching by two men because they not safe near the bus.", "pairID": "1869615544.jpg#1r3n", "captionID": "1869615544.jpg#1"}
{"gold_label": "entailment", "sentence1": "A number of children wearing red shirts with white hearts stand outside a bus, watched by two men, receiving toys.", "sentence2": {"original": ["A number of children are watching by two men."], "negation": ["No number of children am watching by two men.", "No number of children are watching by two men.", "No number of children is watching by two men."], "past progressive": ["A number of children were watching by two men.", "A number of children was watching by two men."], "past simple": ["A number of children watched by two men."], "present progressive": ["A number of children am watching by two men.", "A number of children are watching by two men.", "A number of children is watching by two men."], "present simple": ["A number of children watches by two men.", "A number of children watch by two men."], "future progressive": ["A number of children will be watching by two men."], "future simple": ["A number of children will watch by two men."], "modality: may": ["A number of children may be watching by two men."], "it cleft: ARG1": ["It is a number of children who is watching by two men.", "It is a number of children which is watching by two men.", "It is a number of children that is watching by two men."], "native": ["A number of children am watching by two men.", "A number of children are watching by two men.", "A number of children is watching by two men."], "negation+it cleft: ARG1": ["It is no number of children who is watching by two men.", "It is no number of children which is watching by two men.", "It is no number of children that is watching by two men."], "past progressive+it cleft: ARG1": ["It is a number of children who was watching by two men.", "It is a number of children which was watching by two men.", "It is a number of children that was watching by two men."], "past simple+it cleft: ARG1": ["It is a number of children who watched by two men.", "It is a number of children which watched by two men.", "It is a number of children that watched by two men."], "present progressive+it cleft: ARG1": ["It is a number of children who is watching by two men.", "It is a number of children which is watching by two men.", "It is a number of children that is watching by two men."], "present simple+it cleft: ARG1": ["It is a number of children who watches by two men.", "It is a number of children which watches by two men.", "It is a number of children that watches by two men."], "future progressive+it cleft: ARG1": ["It is a number of children who will be watching by two men.", "It is a number of children which will be watching by two men.", "It is a number of children that will be watching by two men."], "future simple+it cleft: ARG1": ["It is a number of children who will watch by two men.", "It is a number of children which will watch by two men.", "It is a number of children that will watch by two men."]}, "pairID": "1869615544.jpg#1r3e", "captionID": "1869615544.jpg#1"}
{"gold_label": "entailment", "sentence1": {"original": ["A brown and black dog leaps through the freshly mown grass."]}, "sentence2": {"original": ["An animal playing around."]}, "pairID": "2114739371.jpg#1r1e", "captionID": "2114739371.jpg#1"}
{"gold_label": "contradiction", "sentence1": {"original": ["A brown and black dog leaps through the freshly mown grass."]}, "sentence2": {"original": ["A person playing around on a sunny day."]}, "pairID": "2114739371.jpg#1r1c", "captionID": "2114739371.jpg#1"}
{"gold_label": "neutral", "sentence1": "A baseball player in a blue uniform and red helmet is swinging at a pitch.", "sentence2": "There is a baseball game.", "pairID": "5914789066.jpg#2r1n", "captionID": "5914789066.jpg#2"}
{"gold_label": "contradiction", "sentence1": "A girl sits in a grocery cart next to a loaf of bread.", "sentence2": {"original": ["A kid is watching TV."], "negation": ["No kid is watching tv."], "past progressive": ["A kid was watching tv."], "past simple": ["A kid watched tv."], "present progressive": ["A kid is watching tv."], "present simple": ["A kid watches tv."], "future progressive": ["A kid will be watching tv."], "future simple": ["A kid will watch tv."], "modality: may": ["A kid may be watching tv."], "it cleft: ARG1": ["It is a kid who is watching tv.", "It is a kid which is watching tv.", "It is a kid that is watching tv."], "it cleft: ARG2": ["It is tv who is being watched by a kid.", "It is tv which is being watched by a kid.", "It is tv that is being watched by a kid."], "passive: ARG2": ["Tv is being watched by a kid."], "native": ["A kid is watching tv."], "swap subj/obj": ["Tv is watching a kid."], "negation+it cleft: ARG1": ["It is no kid who is watching tv.", "It is no kid which is watching tv.", "It is no kid that is watching tv."], "negation+it cleft: ARG2": ["It is tv who is being watched by no kid.", "It is tv which is being watched by no kid.", "It is tv that is being watched by no kid."], "negation+passive: ARG2": ["Tv is being watched by no kid."], "past progressive+it cleft: ARG1": ["It is a kid who was watching tv.", "It is a kid which was watching tv.", "It is a kid that was watching tv."], "past progressive+it cleft: ARG2": ["It is tv who was being watched by a kid.", "It is tv which was being watched by a kid.", "It is tv that was being watched by a kid."], "past progressive+passive: ARG2": ["Tv was being watched by a kid."], "past simple+it cleft: ARG1": ["It is a kid who watched tv.", "It is a kid which watched tv.", "It is a kid that watched tv."], "past simple+it cleft: ARG2": ["It is tv who was watched by a kid.", "It is tv which was watched by a kid.", "It is tv that was watched by a kid."], "past simple+passive: ARG2": ["Tv was watched by a kid."], "present progressive+it cleft: ARG1": ["It is a kid who is watching tv.", "It is a kid which is watching tv.", "It is a kid that is watching tv."], "present progressive+it cleft: ARG2": ["It is tv who is being watched by a kid.", "It is tv which is being watched by a kid.", "It is tv that is being watched by a kid."], "present progressive+passive: ARG2": ["Tv is being watched by a kid."], "present simple+it cleft: ARG1": ["It is a kid who watches tv.", "It is a kid which watches tv.", "It is a kid that watches tv."], "present simple+it cleft: ARG2": ["It is tv who is watched by a kid.", "It is tv which is watched by a kid.", "It is tv that is watched by a kid."], "present simple+passive: ARG2": ["Tv is watched by a kid."], "future progressive+it cleft: ARG1": ["It is a kid who will be watching tv.", "It is a kid which will be watching tv.", "It is a kid that will be watching tv."], "future progressive+it cleft: ARG2": ["It is tv who will be being watched by a kid.", "It is tv which will be being watched by a kid.", "It is tv that will be being watched by a kid."], "future progressive+passive: ARG2": ["Tv will be being watched by a kid."], "future simple+it cleft: ARG1": ["It is a kid who will watch tv.", "It is a kid which will watch tv.", "It is a kid that will watch tv."], "future simple+it cleft: ARG2": ["It is tv who will be watched by a kid.", "It is tv which will be watched by a kid.", "It is tv that will be watched by a kid."], "future simple+passive: ARG2": ["Tv will be watched by a kid."], "it cleft: ARG1+passive: ARG2": ["It is a kid who tv is being watched by.", "It is a kid which tv is being watched by.", "It is a kid that tv is being watched by.", "It is a kid by which tv is being watched.", "It is a kid by who tv is being watched.", "It is a kid tv is being watched by."], "swap subj/obj+it cleft: ARG1": ["It is tv who is watching a kid.", "It is tv which is watching a kid.", "It is tv that is watching a kid."], "swap subj/obj+it cleft: ARG2": ["It is a kid who is being watched by tv.", "It is a kid which is being watched by tv.", "It is a kid that is being watched by tv."], "swap subj/obj+passive: ARG2": ["A kid is being watched by tv."]}, "pairID": "5337047043.jpg#4r1c", "captionID": "5337047043.jpg#4"}
{"gold_label": "neutral", "sentence1": "A girl sits in a grocery cart next to a loaf of bread.", "sentence2": "There is a girl at the supermarket.", "pairID": "5337047043.jpg#4r1n", "captionID": "5337047043.jpg#4"}
{"gold_label": "entailment", "sentence1": "A girl sits in a grocery cart next to a loaf of bread.", "sentence2": "There is a girl sitting down.", "pairID": "5337047043.jpg#4r1e", "captionID": "5337047043.jpg#4"}
{"gold_label": "contradiction", "sentence1": "Two players in red white and blue football uniforms squat down on the field.", "sentence2": {"original": ["Two players in red white and blue football uniforms squat down on the field and flattening the earth."]}, "pairID": "3070130228.jpg#1r2c", "captionID": "3070130228.jpg#1"}
{"gold_label": "neutral", "sentence1": "Two players in red white and blue football uniforms squat down on the field.", "sentence2": {"original": ["Football players wearing colorful uniforms are on the field."], "negation": ["Football players wearing colorful uniforms are not on the field.", "Football players wearing colorful uniforms aren't on the field."], "past progressive": ["Football players wearing colorful uniforms were being on the field."], "past simple": ["Football players wearing colorful uniforms were on the field."], "present progressive": ["Football players wearing colorful uniforms are being on the field."], "present simple": ["Football players wearing colorful uniforms are on the field."], "future progressive": ["Football players wearing colorful uniforms will be being on the field."], "future simple": ["Football players wearing colorful uniforms will be on the field."], "modality: may": ["Football players wearing colorful uniforms may be on the field."], "it cleft: ARG1": ["It is football players wearing colorful uniforms who are on the field.", "It is football players wearing colorful uniforms which are on the field.", "It is football players wearing colorful uniforms that are on the field."], "native": ["Football players wearing colorful uniforms are on the field."], "swap subj/obj": ["The field is on football players wearing colorful uniforms."], "negation+it cleft: ARG1": ["It is not football players wearing colorful uniforms who are on the field.", "It is not football players wearing colorful uniforms which are on the field.", "It is not football players wearing colorful uniforms that are on the field."], "past progressive+it cleft: ARG1": ["It is football players wearing colorful uniforms who were being on the field.", "It is football players wearing colorful uniforms which were being on the field.", "It is football players wearing colorful uniforms that were being on the field."], "past simple+it cleft: ARG1": ["It is football players wearing colorful uniforms who were on the field.", "It is football players wearing colorful uniforms which were on the field.", "It is football players wearing colorful uniforms that were on the field."], "present progressive+it cleft: ARG1": ["It is football players wearing colorful uniforms who are being on the field.", "It is football players wearing colorful uniforms which are being on the field.", "It is football players wearing colorful uniforms that are being on the field."], "present simple+it cleft: ARG1": ["It is football players wearing colorful uniforms who are on the field.", "It is football players wearing colorful uniforms which are on the field.", "It is football players wearing colorful uniforms that are on the field."], "future progressive+it cleft: ARG1": ["It is football players wearing colorful uniforms who will be being on the field.", "It is football players wearing colorful uniforms which will be being on the field.", "It is football players wearing colorful uniforms that will be being on the field."], "future simple+it cleft: ARG1": ["It is football players wearing colorful uniforms who will be on the field.", "It is football players wearing colorful uniforms which will be on the field.", "It is football players wearing colorful uniforms that will be on the field."], "swap subj/obj+it cleft: ARG1": ["It is the field who is on football players wearing colorful uniforms.", "It is the field which is on football players wearing colorful uniforms.", "It is the field that is on football players wearing colorful uniforms."]}, "pairID": "3070130228.jpg#1r4n", "captionID": "3070130228.jpg#1"}
{"gold_label": "contradiction", "sentence1": "a dog jumps over another dog as both animals are trying to catch the same ball.", "sentence2": "The dogs are asleep on the couch.", "pairID": "3627216820.jpg#0r1c", "captionID": "3627216820.jpg#0"}
{"gold_label": "neutral", "sentence1": {"original": ["A man with brown hair walking his bicycle across the street."]}, "sentence2": {"original": ["A man heading to work."]}, "pairID": "4753058300.jpg#0r1n", "captionID": "4753058300.jpg#0"}
{"gold_label": "contradiction", "sentence1": {"original": ["Two young boys dressed in snowsuits play in the snow."]}, "sentence2": {"original": ["The young boys in snowsuits are drinking hot cocoa."]}, "pairID": "6823748160.jpg#3r1c", "captionID": "6823748160.jpg#3"}
{"gold_label": "entailment", "sentence1": {"original": ["Two young boys dressed in snowsuits play in the snow."]}, "sentence2": {"original": ["The boys are playing on snow."], "negation": ["The boys are not playing on snow.", "The boys aren't playing on snow."], "past progressive": ["The boys were playing on snow."], "past simple": ["The boys played on snow."], "present progressive": ["The boys are playing on snow."], "present simple": ["The boys play on snow."], "future progressive": ["The boys will be playing on snow."], "future simple": ["The boys will play on snow."], "modality: may": ["The boys may be playing on snow."], "it cleft: ARG1": ["It is the boys who are playing on snow.", "It is the boys which are playing on snow.", "It is the boys that are playing on snow."], "native": ["The boys are playing on snow."], "negation+it cleft: ARG1": ["It is not the boys who are playing on snow.", "It is not the boys which are playing on snow.", "It is not the boys that are playing on snow."], "past progressive+it cleft: ARG1": ["It is the boys who were playing on snow.", "It is the boys which were playing on snow.", "It is the boys that were playing on snow."], "past simple+it cleft: ARG1": ["It is the boys who played on snow.", "It is the boys which played on snow.", "It is the boys that played on snow."], "present progressive+it cleft: ARG1": ["It is the boys who are playing on snow.", "It is the boys which are playing on snow.", "It is the boys that are playing on snow."], "present simple+it cleft: ARG1": ["It is the boys who play on snow.", "It is the boys which play on snow.", "It is the boys that play on snow."], "future progressive+it cleft: ARG1": ["It is the boys who will be playing on snow.", "It is the boys which will be playing on snow.", "It is the boys that will be playing on snow."], "future simple+it cleft: ARG1": ["It is the boys who will play on snow.", "It is the boys which will play on snow.", "It is the boys that will play on snow."]}, "pairID": "6823748160.jpg#3r1e", "captionID": "6823748160.jpg#3"}
{"gold_label": "neutral", "sentence1": {"original": ["A long-haired man is taking a photo of a beach."], "negation": ["No long haired man is taking a photograph of a beach.", "No long haired man is taking a photo of a beach.", "No long hair man is taking a photograph of a beach.", "No long hair man is taking a photo of a beach."], "past progressive": ["A long haired man was taking a photograph of a beach.", "A long haired man was taking a photo of a beach.", "A long hair man was taking a photograph of a beach.", "A long hair man was taking a photo of a beach."], "past simple": ["A long haired man took a photograph of a beach.", "A long haired man took a photo of a beach.", "A long hair man took a photograph of a beach.", "A long hair man took a photo of a beach."], "present progressive": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "present simple": ["A long haired man takes a photograph of a beach.", "A long haired man takes a photo of a beach.", "A long hair man takes a photograph of a beach.", "A long hair man takes a photo of a beach."], "future progressive": ["A long haired man will be taking a photograph of a beach.", "A long haired man will be taking a photo of a beach.", "A long hair man will be taking a photograph of a beach.", "A long hair man will be taking a photo of a beach."], "future simple": ["A long haired man will take a photograph of a beach.", "A long haired man will take a photo of a beach.", "A long hair man will take a photograph of a beach.", "A long hair man will take a photo of a beach."], "modality: may": ["A long haired man may be taking a photograph of a beach.", "A long haired man may be taking a photo of a beach.", "A long hair man may be taking a photograph of a beach.", "A long hair man may be taking a photo of a beach."], "it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "native": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "swap subj/obj": ["A photograph of a beach is taking a long haired man.", "A photo of a beach is taking a long haired man.", "A photograph of a beach is taking a long hair man.", "A photo of a beach is taking a long hair man."], "negation+it cleft: ARG1": ["It is no long haired man who is taking a photograph of a beach.", "It is no long haired man who is taking a photo of a beach.", "It is no long haired man which is taking a photograph of a beach.", "It is no long haired man which is taking a photo of a beach.", "It is no long haired man that is taking a photograph of a beach.", "It is no long haired man that is taking a photo of a beach.", "It is no long hair man who is taking a photograph of a beach.", "It is no long hair man who is taking a photo of a beach.", "It is no long hair man which is taking a photograph of a beach.", "It is no long hair man which is taking a photo of a beach.", "It is no long hair man that is taking a photograph of a beach.", "It is no long hair man that is taking a photo of a beach."], "negation+it cleft: ARG2": ["It is a photograph of a beach who is being taken by no long haired man.", "It is a photo of a beach who is being taken by no long haired man.", "It is a photograph of a beach which is being taken by no long haired man.", "It is a photo of a beach which is being taken by no long haired man.", "It is a photograph of a beach that is being taken by no long haired man.", "It is a photo of a beach that is being taken by no long haired man.", "It is a photograph of a beach who is being taken by no long hair man.", "It is a photo of a beach who is being taken by no long hair man.", "It is a photograph of a beach which is being taken by no long hair man.", "It is a photo of a beach which is being taken by no long hair man.", "It is a photograph of a beach that is being taken by no long hair man.", "It is a photo of a beach that is being taken by no long hair man."], "negation+passive: ARG2": ["A photograph of a beach is being taken by no long haired man.", "A photo of a beach is being taken by no long haired man.", "A photograph of a beach is being taken by no long hair man.", "A photo of a beach is being taken by no long hair man."], "past progressive+it cleft: ARG1": ["It is a long haired man who was taking a photograph of a beach.", "It is a long haired man who was taking a photo of a beach.", "It is a long haired man which was taking a photograph of a beach.", "It is a long haired man which was taking a photo of a beach.", "It is a long haired man that was taking a photograph of a beach.", "It is a long haired man that was taking a photo of a beach.", "It is a long hair man who was taking a photograph of a beach.", "It is a long hair man who was taking a photo of a beach.", "It is a long hair man which was taking a photograph of a beach.", "It is a long hair man which was taking a photo of a beach.", "It is a long hair man that was taking a photograph of a beach.", "It is a long hair man that was taking a photo of a beach."], "past progressive+it cleft: ARG2": ["It is a photograph of a beach who was being taken by a long haired man.", "It is a photo of a beach who was being taken by a long haired man.", "It is a photograph of a beach which was being taken by a long haired man.", "It is a photo of a beach which was being taken by a long haired man.", "It is a photograph of a beach that was being taken by a long haired man.", "It is a photo of a beach that was being taken by a long haired man.", "It is a photograph of a beach who was being taken by a long hair man.", "It is a photo of a beach who was being taken by a long hair man.", "It is a photograph of a beach which was being taken by a long hair man.", "It is a photo of a beach which was being taken by a long hair man.", "It is a photograph of a beach that was being taken by a long hair man.", "It is a photo of a beach that was being taken by a long hair man."], "past progressive+passive: ARG2": ["A photograph of a beach was being taken by a long haired man.", "A photo of a beach was being taken by a long haired man.", "A photograph of a beach was being taken by a long hair man.", "A photo of a beach was being taken by a long hair man."], "past simple+it cleft: ARG1": ["It is a long haired man who took a photograph of a beach.", "It is a long haired man who took a photo of a beach.", "It is a long haired man which took a photograph of a beach.", "It is a long haired man which took a photo of a beach.", "It is a long haired man that took a photograph of a beach.", "It is a long haired man that took a photo of a beach.", "It is a long hair man who took a photograph of a beach.", "It is a long hair man who took a photo of a beach.", "It is a long hair man which took a photograph of a beach.", "It is a long hair man which took a photo of a beach.", "It is a long hair man that took a photograph of a beach.", "It is a long hair man that took a photo of a beach."], "past simple+it cleft: ARG2": ["It is a photograph of a beach who was taken by a long haired man.", "It is a photo of a beach who was taken by a long haired man.", "It is a photograph of a beach which was taken by a long haired man.", "It is a photo of a beach which was taken by a long haired man.", "It is a photograph of a beach that was taken by a long haired man.", "It is a photo of a beach that was taken by a long haired man.", "It is a photograph of a beach who was taken by a long hair man.", "It is a photo of a beach who was taken by a long hair man.", "It is a photograph of a beach which was taken by a long hair man.", "It is a photo of a beach which was taken by a long hair man.", "It is a photograph of a beach that was taken by a long hair man.", "It is a photo of a beach that was taken by a long hair man."], "past simple+passive: ARG2": ["A photograph of a beach was taken by a long haired man.", "A photo of a beach was taken by a long haired man.", "A photograph of a beach was taken by a long hair man.", "A photo of a beach was taken by a long hair man."], "present progressive+it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "present progressive+it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "present progressive+passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "present simple+it cleft: ARG1": ["It is a long haired man who takes a photograph of a beach.", "It is a long haired man who takes a photo of a beach.", "It is a long haired man which takes a photograph of a beach.", "It is a long haired man which takes a photo of a beach.", "It is a long haired man that takes a photograph of a beach.", "It is a long haired man that takes a photo of a beach.", "It is a long hair man who takes a photograph of a beach.", "It is a long hair man who takes a photo of a beach.", "It is a long hair man which takes a photograph of a beach.", "It is a long hair man which takes a photo of a beach.", "It is a long hair man that takes a photograph of a beach.", "It is a long hair man that takes a photo of a beach."], "present simple+it cleft: ARG2": ["It is a photograph of a beach who is taken by a long haired man.", "It is a photo of a beach who is taken by a long haired man.", "It is a photograph of a beach which is taken by a long haired man.", "It is a photo of a beach which is taken by a long haired man.", "It is a photograph of a beach that is taken by a long haired man.", "It is a photo of a beach that is taken by a long haired man.", "It is a photograph of a beach who is taken by a long hair man.", "It is a photo of a beach who is taken by a long hair man.", "It is a photograph of a beach which is taken by a long hair man.", "It is a photo of a beach which is taken by a long hair man.", "It is a photograph of a beach that is taken by a long hair man.", "It is a photo of a beach that is taken by a long hair man."], "present simple+passive: ARG2": ["A photograph of a beach is taken by a long haired man.", "A photo of a beach is taken by a long haired man.", "A photograph of a beach is taken by a long hair man.", "A photo of a beach is taken by a long hair man."], "future progressive+it cleft: ARG1": ["It is a long haired man who will be taking a photograph of a beach.", "It is a long haired man who will be taking a photo of a beach.", "It is a long haired man which will be taking a photograph of a beach.", "It is a long haired man which will be taking a photo of a beach.", "It is a long haired man that will be taking a photograph of a beach.", "It is a long haired man that will be taking a photo of a beach.", "It is a long hair man who will be taking a photograph of a beach.", "It is a long hair man who will be taking a photo of a beach.", "It is a long hair man which will be taking a photograph of a beach.", "It is a long hair man which will be taking a photo of a beach.", "It is a long hair man that will be taking a photograph of a beach.", "It is a long hair man that will be taking a photo of a beach."], "future progressive+it cleft: ARG2": ["It is a photograph of a beach who will be being taken by a long haired man.", "It is a photo of a beach who will be being taken by a long haired man.", "It is a photograph of a beach which will be being taken by a long haired man.", "It is a photo of a beach which will be being taken by a long haired man.", "It is a photograph of a beach that will be being taken by a long haired man.", "It is a photo of a beach that will be being taken by a long haired man.", "It is a photograph of a beach who will be being taken by a long hair man.", "It is a photo of a beach who will be being taken by a long hair man.", "It is a photograph of a beach which will be being taken by a long hair man.", "It is a photo of a beach which will be being taken by a long hair man.", "It is a photograph of a beach that will be being taken by a long hair man.", "It is a photo of a beach that will be being taken by a long hair man."], "future progressive+passive: ARG2": ["A photograph of a beach will be being taken by a long haired man.", "A photo of a beach will be being taken by a long haired man.", "A photograph of a beach will be being taken by a long hair man.", "A photo of a beach will be being taken by a long hair man."], "future simple+it cleft: ARG1": ["It is a long haired man who will take a photograph of a beach.", "It is a long haired man who will take a photo of a beach.", "It is a long haired man which will take a photograph of a beach.", "It is a long haired man which will take a photo of a beach.", "It is a long haired man that will take a photograph of a beach.", "It is a long haired man that will take a photo of a beach.", "It is a long hair man who will take a photograph of a beach.", "It is a long hair man who will take a photo of a beach.", "It is a long hair man which will take a photograph of a beach.", "It is a long hair man which will take a photo of a beach.", "It is a long hair man that will take a photograph of a beach.", "It is a long hair man that will take a photo of a beach."], "future simple+it cleft: ARG2": ["It is a photograph of a beach who will be taken by a long haired man.", "It is a photo of a beach who will be taken by a long haired man.", "It is a photograph of a beach which will be taken by a long haired man.", "It is a photo of a beach which will be taken by a long haired man.", "It is a photograph of a beach that will be taken by a long haired man.", "It is a photo of a beach that will be taken by a long haired man.", "It is a photograph of a beach who will be taken by a long hair man.", "It is a photo of a beach who will be taken by a long hair man.", "It is a photograph of a beach which will be taken by a long hair man.", "It is a photo of a beach which will be taken by a long hair man.", "It is a photograph of a beach that will be taken by a long hair man.", "It is a photo of a beach that will be taken by a long hair man."], "future simple+passive: ARG2": ["A photograph of a beach will be taken by a long haired man.", "A photo of a beach will be taken by a long haired man.", "A photograph of a beach will be taken by a long hair man.", "A photo of a beach will be taken by a long hair man."], "it cleft: ARG1+passive: ARG2": ["It is a long haired man who a photograph of a beach is being taken by.", "It is a long haired man who a photo of a beach is being taken by.", "It is a long haired man which a photograph of a beach is being taken by.", "It is a long haired man which a photo of a beach is being taken by.", "It is a long haired man that a photograph of a beach is being taken by.", "It is a long haired man that a photo of a beach is being taken by.", "It is a long haired man by which a photograph of a beach is being taken.", "It is a long haired man by which a photo of a beach is being taken.", "It is a long haired man by who a photograph of a beach is being taken.", "It is a long haired man by who a photo of a beach is being taken.", "It is a long hair man who a photograph of a beach is being taken by.", "It is a long hair man who a photo of a beach is being taken by.", "It is a long hair man which a photograph of a beach is being taken by.", "It is a long hair man which a photo of a beach is being taken by.", "It is a long hair man that a photograph of a beach is being taken by.", "It is a long hair man that a photo of a beach is being taken by.", "It is a long hair man by which a photograph of a beach is being taken.", "It is a long hair man by which a photo of a beach is being taken.", "It is a long haired man a photograph of a beach is being taken by.", "It is a long haired man a photo of a beach is being taken by.", "It is a long hair man by who a photograph of a beach is being taken.", "It is a long hair man by who a photo of a beach is being taken.", "It is a long hair man a photograph of a beach is being taken by.", "It is a long hair man a photo of a beach is being taken by."], "swap subj/obj+it cleft: ARG1": ["It is a photograph of a beach who is taking a long haired man.", "It is a photo of a beach who is taking a long haired man.", "It is a photograph of a beach which is taking a long haired man.", "It is a photo of a beach which is taking a long haired man.", "It is a photograph of a beach that is taking a long haired man.", "It is a photo of a beach that is taking a long haired man.", "It is a photograph of a beach who is taking a long hair man.", "It is a photo of a beach who is taking a long hair man.", "It is a photograph of a beach which is taking a long hair man.", "It is a photo of a beach which is taking a long hair man.", "It is a photograph of a beach that is taking a long hair man.", "It is a photo of a beach that is taking a long hair man."], "swap subj/obj+it cleft: ARG2": ["It is a long haired man who is being taken by a photograph of a beach.", "It is a long haired man who is being taken by a photo of a beach.", "It is a long haired man which is being taken by a photograph of a beach.", "It is a long haired man which is being taken by a photo of a beach.", "It is a long haired man that is being taken by a photograph of a beach.", "It is a long haired man that is being taken by a photo of a beach.", "It is a long hair man who is being taken by a photograph of a beach.", "It is a long hair man who is being taken by a photo of a beach.", "It is a long hair man which is being taken by a photograph of a beach.", "It is a long hair man which is being taken by a photo of a beach.", "It is a long hair man that is being taken by a photograph of a beach.", "It is a long hair man that is being taken by a photo of a beach."], "swap subj/obj+passive: ARG2": ["A long haired man is being taken by a photograph of a beach.", "A long haired man is being taken by a photo of a beach.", "A long hair man is being taken by a photograph of a beach.", "A long hair man is being taken by a photo of a beach."]}, "sentence2": {"original": ["A man taking a photo of the sand."]}, "pairID": "6796432180.jpg#2r1n", "captionID": "6796432180.jpg#2"}
{"gold_label": "entailment", "sentence1": {"original": ["A long-haired man is taking a photo of a beach."], "negation": ["No long haired man is taking a photograph of a beach.", "No long haired man is taking a photo of a beach.", "No long hair man is taking a photograph of a beach.", "No long hair man is taking a photo of a beach."], "past progressive": ["A long haired man was taking a photograph of a beach.", "A long haired man was taking a photo of a beach.", "A long hair man was taking a photograph of a beach.", "A long hair man was taking a photo of a beach."], "past simple": ["A long haired man took a photograph of a beach.", "A long haired man took a photo of a beach.", "A long hair man took a photograph of a beach.", "A long hair man took a photo of a beach."], "present progressive": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "present simple": ["A long haired man takes a photograph of a beach.", "A long haired man takes a photo of a beach.", "A long hair man takes a photograph of a beach.", "A long hair man takes a photo of a beach."], "future progressive": ["A long haired man will be taking a photograph of a beach.", "A long haired man will be taking a photo of a beach.", "A long hair man will be taking a photograph of a beach.", "A long hair man will be taking a photo of a beach."], "future simple": ["A long haired man will take a photograph of a beach.", "A long haired man will take a photo of a beach.", "A long hair man will take a photograph of a beach.", "A long hair man will take a photo of a beach."], "modality: may": ["A long haired man may be taking a photograph of a beach.", "A long haired man may be taking a photo of a beach.", "A long hair man may be taking a photograph of a beach.", "A long hair man may be taking a photo of a beach."], "it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "native": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "swap subj/obj": ["A photograph of a beach is taking a long haired man.", "A photo of a beach is taking a long haired man.", "A photograph of a beach is taking a long hair man.", "A photo of a beach is taking a long hair man."], "negation+it cleft: ARG1": ["It is no long haired man who is taking a photograph of a beach.", "It is no long haired man who is taking a photo of a beach.", "It is no long haired man which is taking a photograph of a beach.", "It is no long haired man which is taking a photo of a beach.", "It is no long haired man that is taking a photograph of a beach.", "It is no long haired man that is taking a photo of a beach.", "It is no long hair man who is taking a photograph of a beach.", "It is no long hair man who is taking a photo of a beach.", "It is no long hair man which is taking a photograph of a beach.", "It is no long hair man which is taking a photo of a beach.", "It is no long hair man that is taking a photograph of a beach.", "It is no long hair man that is taking a photo of a beach."], "negation+it cleft: ARG2": ["It is a photograph of a beach who is being taken by no long haired man.", "It is a photo of a beach who is being taken by no long haired man.", "It is a photograph of a beach which is being taken by no long haired man.", "It is a photo of a beach which is being taken by no long haired man.", "It is a photograph of a beach that is being taken by no long haired man.", "It is a photo of a beach that is being taken by no long haired man.", "It is a photograph of a beach who is being taken by no long hair man.", "It is a photo of a beach who is being taken by no long hair man.", "It is a photograph of a beach which is being taken by no long hair man.", "It is a photo of a beach which is being taken by no long hair man.", "It is a photograph of a beach that is being taken by no long hair man.", "It is a photo of a beach that is being taken by no long hair man."], "negation+passive: ARG2": ["A photograph of a beach is being taken by no long haired man.", "A photo of a beach is being taken by no long haired man.", "A photograph of a beach is being taken by no long hair man.", "A photo of a beach is being taken by no long hair man."], "past progressive+it cleft: ARG1": ["It is a long haired man who was taking a photograph of a beach.", "It is a long haired man who was taking a photo of a beach.", "It is a long haired man which was taking a photograph of a beach.", "It is a long haired man which was taking a photo of a beach.", "It is a long haired man that was taking a photograph of a beach.", "It is a long haired man that was taking a photo of a beach.", "It is a long hair man who was taking a photograph of a beach.", "It is a long hair man who was taking a photo of a beach.", "It is a long hair man which was taking a photograph of a beach.", "It is a long hair man which was taking a photo of a beach.", "It is a long hair man that was taking a photograph of a beach.", "It is a long hair man that was taking a photo of a beach."], "past progressive+it cleft: ARG2": ["It is a photograph of a beach who was being taken by a long haired man.", "It is a photo of a beach who was being taken by a long haired man.", "It is a photograph of a beach which was being taken by a long haired man.", "It is a photo of a beach which was being taken by a long haired man.", "It is a photograph of a beach that was being taken by a long haired man.", "It is a photo of a beach that was being taken by a long haired man.", "It is a photograph of a beach who was being taken by a long hair man.", "It is a photo of a beach who was being taken by a long hair man.", "It is a photograph of a beach which was being taken by a long hair man.", "It is a photo of a beach which was being taken by a long hair man.", "It is a photograph of a beach that was being taken by a long hair man.", "It is a photo of a beach that was being taken by a long hair man."], "past progressive+passive: ARG2": ["A photograph of a beach was being taken by a long haired man.", "A photo of a beach was being taken by a long haired man.", "A photograph of a beach was being taken by a long hair man.", "A photo of a beach was being taken by a long hair man."], "past simple+it cleft: ARG1": ["It is a long haired man who took a photograph of a beach.", "It is a long haired man who took a photo of a beach.", "It is a long haired man which took a photograph of a beach.", "It is a long haired man which took a photo of a beach.", "It is a long haired man that took a photograph of a beach.", "It is a long haired man that took a photo of a beach.", "It is a long hair man who took a photograph of a beach.", "It is a long hair man who took a photo of a beach.", "It is a long hair man which took a photograph of a beach.", "It is a long hair man which took a photo of a beach.", "It is a long hair man that took a photograph of a beach.", "It is a long hair man that took a photo of a beach."], "past simple+it cleft: ARG2": ["It is a photograph of a beach who was taken by a long haired man.", "It is a photo of a beach who was taken by a long haired man.", "It is a photograph of a beach which was taken by a long haired man.", "It is a photo of a beach which was taken by a long haired man.", "It is a photograph of a beach that was taken by a long haired man.", "It is a photo of a beach that was taken by a long haired man.", "It is a photograph of a beach who was taken by a long hair man.", "It is a photo of a beach who was taken by a long hair man.", "It is a photograph of a beach which was taken by a long hair man.", "It is a photo of a beach which was taken by a long hair man.", "It is a photograph of a beach that was taken by a long hair man.", "It is a photo of a beach that was taken by a long hair man."], "past simple+passive: ARG2": ["A photograph of a beach was taken by a long haired man.", "A photo of a beach was taken by a long haired man.", "A photograph of a beach was taken by a long hair man.", "A photo of a beach was taken by a long hair man."], "present progressive+it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "present progressive+it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "present progressive+passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "present simple+it cleft: ARG1": ["It is a long haired man who takes a photograph of a beach.", "It is a long haired man who takes a photo of a beach.", "It is a long haired man which takes a photograph of a beach.", "It is a long haired man which takes a photo of a beach.", "It is a long haired man that takes a photograph of a beach.", "It is a long haired man that takes a photo of a beach.", "It is a long hair man who takes a photograph of a beach.", "It is a long hair man who takes a photo of a beach.", "It is a long hair man which takes a photograph of a beach.", "It is a long hair man which takes a photo of a beach.", "It is a long hair man that takes a photograph of a beach.", "It is a long hair man that takes a photo of a beach."], "present simple+it cleft: ARG2": ["It is a photograph of a beach who is taken by a long haired man.", "It is a photo of a beach who is taken by a long haired man.", "It is a photograph of a beach which is taken by a long haired man.", "It is a photo of a beach which is taken by a long haired man.", "It is a photograph of a beach that is taken by a long haired man.", "It is a photo of a beach that is taken by a long haired man.", "It is a photograph of a beach who is taken by a long hair man.", "It is a photo of a beach who is taken by a long hair man.", "It is a photograph of a beach which is taken by a long hair man.", "It is a photo of a beach which is taken by a long hair man.", "It is a photograph of a beach that is taken by a long hair man.", "It is a photo of a beach that is taken by a long hair man."], "present simple+passive: ARG2": ["A photograph of a beach is taken by a long haired man.", "A photo of a beach is taken by a long haired man.", "A photograph of a beach is taken by a long hair man.", "A photo of a beach is taken by a long hair man."], "future progressive+it cleft: ARG1": ["It is a long haired man who will be taking a photograph of a beach.", "It is a long haired man who will be taking a photo of a beach.", "It is a long haired man which will be taking a photograph of a beach.", "It is a long haired man which will be taking a photo of a beach.", "It is a long haired man that will be taking a photograph of a beach.", "It is a long haired man that will be taking a photo of a beach.", "It is a long hair man who will be taking a photograph of a beach.", "It is a long hair man who will be taking a photo of a beach.", "It is a long hair man which will be taking a photograph of a beach.", "It is a long hair man which will be taking a photo of a beach.", "It is a long hair man that will be taking a photograph of a beach.", "It is a long hair man that will be taking a photo of a beach."], "future progressive+it cleft: ARG2": ["It is a photograph of a beach who will be being taken by a long haired man.", "It is a photo of a beach who will be being taken by a long haired man.", "It is a photograph of a beach which will be being taken by a long haired man.", "It is a photo of a beach which will be being taken by a long haired man.", "It is a photograph of a beach that will be being taken by a long haired man.", "It is a photo of a beach that will be being taken by a long haired man.", "It is a photograph of a beach who will be being taken by a long hair man.", "It is a photo of a beach who will be being taken by a long hair man.", "It is a photograph of a beach which will be being taken by a long hair man.", "It is a photo of a beach which will be being taken by a long hair man.", "It is a photograph of a beach that will be being taken by a long hair man.", "It is a photo of a beach that will be being taken by a long hair man."], "future progressive+passive: ARG2": ["A photograph of a beach will be being taken by a long haired man.", "A photo of a beach will be being taken by a long haired man.", "A photograph of a beach will be being taken by a long hair man.", "A photo of a beach will be being taken by a long hair man."], "future simple+it cleft: ARG1": ["It is a long haired man who will take a photograph of a beach.", "It is a long haired man who will take a photo of a beach.", "It is a long haired man which will take a photograph of a beach.", "It is a long haired man which will take a photo of a beach.", "It is a long haired man that will take a photograph of a beach.", "It is a long haired man that will take a photo of a beach.", "It is a long hair man who will take a photograph of a beach.", "It is a long hair man who will take a photo of a beach.", "It is a long hair man which will take a photograph of a beach.", "It is a long hair man which will take a photo of a beach.", "It is a long hair man that will take a photograph of a beach.", "It is a long hair man that will take a photo of a beach."], "future simple+it cleft: ARG2": ["It is a photograph of a beach who will be taken by a long haired man.", "It is a photo of a beach who will be taken by a long haired man.", "It is a photograph of a beach which will be taken by a long haired man.", "It is a photo of a beach which will be taken by a long haired man.", "It is a photograph of a beach that will be taken by a long haired man.", "It is a photo of a beach that will be taken by a long haired man.", "It is a photograph of a beach who will be taken by a long hair man.", "It is a photo of a beach who will be taken by a long hair man.", "It is a photograph of a beach which will be taken by a long hair man.", "It is a photo of a beach which will be taken by a long hair man.", "It is a photograph of a beach that will be taken by a long hair man.", "It is a photo of a beach that will be taken by a long hair man."], "future simple+passive: ARG2": ["A photograph of a beach will be taken by a long haired man.", "A photo of a beach will be taken by a long haired man.", "A photograph of a beach will be taken by a long hair man.", "A photo of a beach will be taken by a long hair man."], "it cleft: ARG1+passive: ARG2": ["It is a long haired man who a photograph of a beach is being taken by.", "It is a long haired man who a photo of a beach is being taken by.", "It is a long haired man which a photograph of a beach is being taken by.", "It is a long haired man which a photo of a beach is being taken by.", "It is a long haired man that a photograph of a beach is being taken by.", "It is a long haired man that a photo of a beach is being taken by.", "It is a long haired man by which a photograph of a beach is being taken.", "It is a long haired man by which a photo of a beach is being taken.", "It is a long haired man by who a photograph of a beach is being taken.", "It is a long haired man by who a photo of a beach is being taken.", "It is a long hair man who a photograph of a beach is being taken by.", "It is a long hair man who a photo of a beach is being taken by.", "It is a long hair man which a photograph of a beach is being taken by.", "It is a long hair man which a photo of a beach is being taken by.", "It is a long hair man that a photograph of a beach is being taken by.", "It is a long hair man that a photo of a beach is being taken by.", "It is a long hair man by which a photograph of a beach is being taken.", "It is a long hair man by which a photo of a beach is being taken.", "It is a long haired man a photograph of a beach is being taken by.", "It is a long haired man a photo of a beach is being taken by.", "It is a long hair man by who a photograph of a beach is being taken.", "It is a long hair man by who a photo of a beach is being taken.", "It is a long hair man a photograph of a beach is being taken by.", "It is a long hair man a photo of a beach is being taken by."], "swap subj/obj+it cleft: ARG1": ["It is a photograph of a beach who is taking a long haired man.", "It is a photo of a beach who is taking a long haired man.", "It is a photograph of a beach which is taking a long haired man.", "It is a photo of a beach which is taking a long haired man.", "It is a photograph of a beach that is taking a long haired man.", "It is a photo of a beach that is taking a long haired man.", "It is a photograph of a beach who is taking a long hair man.", "It is a photo of a beach who is taking a long hair man.", "It is a photograph of a beach which is taking a long hair man.", "It is a photo of a beach which is taking a long hair man.", "It is a photograph of a beach that is taking a long hair man.", "It is a photo of a beach that is taking a long hair man."], "swap subj/obj+it cleft: ARG2": ["It is a long haired man who is being taken by a photograph of a beach.", "It is a long haired man who is being taken by a photo of a beach.", "It is a long haired man which is being taken by a photograph of a beach.", "It is a long haired man which is being taken by a photo of a beach.", "It is a long haired man that is being taken by a photograph of a beach.", "It is a long haired man that is being taken by a photo of a beach.", "It is a long hair man who is being taken by a photograph of a beach.", "It is a long hair man who is being taken by a photo of a beach.", "It is a long hair man which is being taken by a photograph of a beach.", "It is a long hair man which is being taken by a photo of a beach.", "It is a long hair man that is being taken by a photograph of a beach.", "It is a long hair man that is being taken by a photo of a beach."], "swap subj/obj+passive: ARG2": ["A long haired man is being taken by a photograph of a beach.", "A long haired man is being taken by a photo of a beach.", "A long hair man is being taken by a photograph of a beach.", "A long hair man is being taken by a photo of a beach."]}, "sentence2": {"original": ["A man with a camera."]}, "pairID": "6796432180.jpg#2r1e", "captionID": "6796432180.jpg#2"}
{"gold_label": "contradiction", "sentence1": {"original": ["A long-haired man is taking a photo of a beach."], "negation": ["No long haired man is taking a photograph of a beach.", "No long haired man is taking a photo of a beach.", "No long hair man is taking a photograph of a beach.", "No long hair man is taking a photo of a beach."], "past progressive": ["A long haired man was taking a photograph of a beach.", "A long haired man was taking a photo of a beach.", "A long hair man was taking a photograph of a beach.", "A long hair man was taking a photo of a beach."], "past simple": ["A long haired man took a photograph of a beach.", "A long haired man took a photo of a beach.", "A long hair man took a photograph of a beach.", "A long hair man took a photo of a beach."], "present progressive": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "present simple": ["A long haired man takes a photograph of a beach.", "A long haired man takes a photo of a beach.", "A long hair man takes a photograph of a beach.", "A long hair man takes a photo of a beach."], "future progressive": ["A long haired man will be taking a photograph of a beach.", "A long haired man will be taking a photo of a beach.", "A long hair man will be taking a photograph of a beach.", "A long hair man will be taking a photo of a beach."], "future simple": ["A long haired man will take a photograph of a beach.", "A long haired man will take a photo of a beach.", "A long hair man will take a photograph of a beach.", "A long hair man will take a photo of a beach."], "modality: may": ["A long haired man may be taking a photograph of a beach.", "A long haired man may be taking a photo of a beach.", "A long hair man may be taking a photograph of a beach.", "A long hair man may be taking a photo of a beach."], "it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "native": ["A long haired man is taking a photograph of a beach.", "A long haired man is taking a photo of a beach.", "A long hair man is taking a photograph of a beach.", "A long hair man is taking a photo of a beach."], "swap subj/obj": ["A photograph of a beach is taking a long haired man.", "A photo of a beach is taking a long haired man.", "A photograph of a beach is taking a long hair man.", "A photo of a beach is taking a long hair man."], "negation+it cleft: ARG1": ["It is no long haired man who is taking a photograph of a beach.", "It is no long haired man who is taking a photo of a beach.", "It is no long haired man which is taking a photograph of a beach.", "It is no long haired man which is taking a photo of a beach.", "It is no long haired man that is taking a photograph of a beach.", "It is no long haired man that is taking a photo of a beach.", "It is no long hair man who is taking a photograph of a beach.", "It is no long hair man who is taking a photo of a beach.", "It is no long hair man which is taking a photograph of a beach.", "It is no long hair man which is taking a photo of a beach.", "It is no long hair man that is taking a photograph of a beach.", "It is no long hair man that is taking a photo of a beach."], "negation+it cleft: ARG2": ["It is a photograph of a beach who is being taken by no long haired man.", "It is a photo of a beach who is being taken by no long haired man.", "It is a photograph of a beach which is being taken by no long haired man.", "It is a photo of a beach which is being taken by no long haired man.", "It is a photograph of a beach that is being taken by no long haired man.", "It is a photo of a beach that is being taken by no long haired man.", "It is a photograph of a beach who is being taken by no long hair man.", "It is a photo of a beach who is being taken by no long hair man.", "It is a photograph of a beach which is being taken by no long hair man.", "It is a photo of a beach which is being taken by no long hair man.", "It is a photograph of a beach that is being taken by no long hair man.", "It is a photo of a beach that is being taken by no long hair man."], "negation+passive: ARG2": ["A photograph of a beach is being taken by no long haired man.", "A photo of a beach is being taken by no long haired man.", "A photograph of a beach is being taken by no long hair man.", "A photo of a beach is being taken by no long hair man."], "past progressive+it cleft: ARG1": ["It is a long haired man who was taking a photograph of a beach.", "It is a long haired man who was taking a photo of a beach.", "It is a long haired man which was taking a photograph of a beach.", "It is a long haired man which was taking a photo of a beach.", "It is a long haired man that was taking a photograph of a beach.", "It is a long haired man that was taking a photo of a beach.", "It is a long hair man who was taking a photograph of a beach.", "It is a long hair man who was taking a photo of a beach.", "It is a long hair man which was taking a photograph of a beach.", "It is a long hair man which was taking a photo of a beach.", "It is a long hair man that was taking a photograph of a beach.", "It is a long hair man that was taking a photo of a beach."], "past progressive+it cleft: ARG2": ["It is a photograph of a beach who was being taken by a long haired man.", "It is a photo of a beach who was being taken by a long haired man.", "It is a photograph of a beach which was being taken by a long haired man.", "It is a photo of a beach which was being taken by a long haired man.", "It is a photograph of a beach that was being taken by a long haired man.", "It is a photo of a beach that was being taken by a long haired man.", "It is a photograph of a beach who was being taken by a long hair man.", "It is a photo of a beach who was being taken by a long hair man.", "It is a photograph of a beach which was being taken by a long hair man.", "It is a photo of a beach which was being taken by a long hair man.", "It is a photograph of a beach that was being taken by a long hair man.", "It is a photo of a beach that was being taken by a long hair man."], "past progressive+passive: ARG2": ["A photograph of a beach was being taken by a long haired man.", "A photo of a beach was being taken by a long haired man.", "A photograph of a beach was being taken by a long hair man.", "A photo of a beach was being taken by a long hair man."], "past simple+it cleft: ARG1": ["It is a long haired man who took a photograph of a beach.", "It is a long haired man who took a photo of a beach.", "It is a long haired man which took a photograph of a beach.", "It is a long haired man which took a photo of a beach.", "It is a long haired man that took a photograph of a beach.", "It is a long haired man that took a photo of a beach.", "It is a long hair man who took a photograph of a beach.", "It is a long hair man who took a photo of a beach.", "It is a long hair man which took a photograph of a beach.", "It is a long hair man which took a photo of a beach.", "It is a long hair man that took a photograph of a beach.", "It is a long hair man that took a photo of a beach."], "past simple+it cleft: ARG2": ["It is a photograph of a beach who was taken by a long haired man.", "It is a photo of a beach who was taken by a long haired man.", "It is a photograph of a beach which was taken by a long haired man.", "It is a photo of a beach which was taken by a long haired man.", "It is a photograph of a beach that was taken by a long haired man.", "It is a photo of a beach that was taken by a long haired man.", "It is a photograph of a beach who was taken by a long hair man.", "It is a photo of a beach who was taken by a long hair man.", "It is a photograph of a beach which was taken by a long hair man.", "It is a photo of a beach which was taken by a long hair man.", "It is a photograph of a beach that was taken by a long hair man.", "It is a photo of a beach that was taken by a long hair man."], "past simple+passive: ARG2": ["A photograph of a beach was taken by a long haired man.", "A photo of a beach was taken by a long haired man.", "A photograph of a beach was taken by a long hair man.", "A photo of a beach was taken by a long hair man."], "present progressive+it cleft: ARG1": ["It is a long haired man who is taking a photograph of a beach.", "It is a long haired man who is taking a photo of a beach.", "It is a long haired man which is taking a photograph of a beach.", "It is a long haired man which is taking a photo of a beach.", "It is a long haired man that is taking a photograph of a beach.", "It is a long haired man that is taking a photo of a beach.", "It is a long hair man who is taking a photograph of a beach.", "It is a long hair man who is taking a photo of a beach.", "It is a long hair man which is taking a photograph of a beach.", "It is a long hair man which is taking a photo of a beach.", "It is a long hair man that is taking a photograph of a beach.", "It is a long hair man that is taking a photo of a beach."], "present progressive+it cleft: ARG2": ["It is a photograph of a beach who is being taken by a long haired man.", "It is a photo of a beach who is being taken by a long haired man.", "It is a photograph of a beach which is being taken by a long haired man.", "It is a photo of a beach which is being taken by a long haired man.", "It is a photograph of a beach that is being taken by a long haired man.", "It is a photo of a beach that is being taken by a long haired man.", "It is a photograph of a beach who is being taken by a long hair man.", "It is a photo of a beach who is being taken by a long hair man.", "It is a photograph of a beach which is being taken by a long hair man.", "It is a photo of a beach which is being taken by a long hair man.", "It is a photograph of a beach that is being taken by a long hair man.", "It is a photo of a beach that is being taken by a long hair man."], "present progressive+passive: ARG2": ["A photograph of a beach is being taken by a long haired man.", "A photo of a beach is being taken by a long haired man.", "A photograph of a beach is being taken by a long hair man.", "A photo of a beach is being taken by a long hair man."], "present simple+it cleft: ARG1": ["It is a long haired man who takes a photograph of a beach.", "It is a long haired man who takes a photo of a beach.", "It is a long haired man which takes a photograph of a beach.", "It is a long haired man which takes a photo of a beach.", "It is a long haired man that takes a photograph of a beach.", "It is a long haired man that takes a photo of a beach.", "It is a long hair man who takes a photograph of a beach.", "It is a long hair man who takes a photo of a beach.", "It is a long hair man which takes a photograph of a beach.", "It is a long hair man which takes a photo of a beach.", "It is a long hair man that takes a photograph of a beach.", "It is a long hair man that takes a photo of a beach."], "present simple+it cleft: ARG2": ["It is a photograph of a beach who is taken by a long haired man.", "It is a photo of a beach who is taken by a long haired man.", "It is a photograph of a beach which is taken by a long haired man.", "It is a photo of a beach which is taken by a long haired man.", "It is a photograph of a beach that is taken by a long haired man.", "It is a photo of a beach that is taken by a long haired man.", "It is a photograph of a beach who is taken by a long hair man.", "It is a photo of a beach who is taken by a long hair man.", "It is a photograph of a beach which is taken by a long hair man.", "It is a photo of a beach which is taken by a long hair man.", "It is a photograph of a beach that is taken by a long hair man.", "It is a photo of a beach that is taken by a long hair man."], "present simple+passive: ARG2": ["A photograph of a beach is taken by a long haired man.", "A photo of a beach is taken by a long haired man.", "A photograph of a beach is taken by a long hair man.", "A photo of a beach is taken by a long hair man."], "future progressive+it cleft: ARG1": ["It is a long haired man who will be taking a photograph of a beach.", "It is a long haired man who will be taking a photo of a beach.", "It is a long haired man which will be taking a photograph of a beach.", "It is a long haired man which will be taking a photo of a beach.", "It is a long haired man that will be taking a photograph of a beach.", "It is a long haired man that will be taking a photo of a beach.", "It is a long hair man who will be taking a photograph of a beach.", "It is a long hair man who will be taking a photo of a beach.", "It is a long hair man which will be taking a photograph of a beach.", "It is a long hair man which will be taking a photo of a beach.", "It is a long hair man that will be taking a photograph of a beach.", "It is a long hair man that will be taking a photo of a beach."], "future progressive+it cleft: ARG2": ["It is a photograph of a beach who will be being taken by a long haired man.", "It is a photo of a beach who will be being taken by a long haired man.", "It is a photograph of a beach which will be being taken by a long haired man.", "It is a photo of a beach which will be being taken by a long haired man.", "It is a photograph of a beach that will be being taken by a long haired man.", "It is a photo of a beach that will be being taken by a long haired man.", "It is a photograph of a beach who will be being taken by a long hair man.", "It is a photo of a beach who will be being taken by a long hair man.", "It is a photograph of a beach which will be being taken by a long hair man.", "It is a photo of a beach which will be being taken by a long hair man.", "It is a photograph of a beach that will be being taken by a long hair man.", "It is a photo of a beach that will be being taken by a long hair man."], "future progressive+passive: ARG2": ["A photograph of a beach will be being taken by a long haired man.", "A photo of a beach will be being taken by a long haired man.", "A photograph of a beach will be being taken by a long hair man.", "A photo of a beach will be being taken by a long hair man."], "future simple+it cleft: ARG1": ["It is a long haired man who will take a photograph of a beach.", "It is a long haired man who will take a photo of a beach.", "It is a long haired man which will take a photograph of a beach.", "It is a long haired man which will take a photo of a beach.", "It is a long haired man that will take a photograph of a beach.", "It is a long haired man that will take a photo of a beach.", "It is a long hair man who will take a photograph of a beach.", "It is a long hair man who will take a photo of a beach.", "It is a long hair man which will take a photograph of a beach.", "It is a long hair man which will take a photo of a beach.", "It is a long hair man that will take a photograph of a beach.", "It is a long hair man that will take a photo of a beach."], "future simple+it cleft: ARG2": ["It is a photograph of a beach who will be taken by a long haired man.", "It is a photo of a beach who will be taken by a long haired man.", "It is a photograph of a beach which will be taken by a long haired man.", "It is a photo of a beach which will be taken by a long haired man.", "It is a photograph of a beach that will be taken by a long haired man.", "It is a photo of a beach that will be taken by a long haired man.", "It is a photograph of a beach who will be taken by a long hair man.", "It is a photo of a beach who will be taken by a long hair man.", "It is a photograph of a beach which will be taken by a long hair man.", "It is a photo of a beach which will be taken by a long hair man.", "It is a photograph of a beach that will be taken by a long hair man.", "It is a photo of a beach that will be taken by a long hair man."], "future simple+passive: ARG2": ["A photograph of a beach will be taken by a long haired man.", "A photo of a beach will be taken by a long haired man.", "A photograph of a beach will be taken by a long hair man.", "A photo of a beach will be taken by a long hair man."], "it cleft: ARG1+passive: ARG2": ["It is a long haired man who a photograph of a beach is being taken by.", "It is a long haired man who a photo of a beach is being taken by.", "It is a long haired man which a photograph of a beach is being taken by.", "It is a long haired man which a photo of a beach is being taken by.", "It is a long haired man that a photograph of a beach is being taken by.", "It is a long haired man that a photo of a beach is being taken by.", "It is a long haired man by which a photograph of a beach is being taken.", "It is a long haired man by which a photo of a beach is being taken.", "It is a long haired man by who a photograph of a beach is being taken.", "It is a long haired man by who a photo of a beach is being taken.", "It is a long hair man who a photograph of a beach is being taken by.", "It is a long hair man who a photo of a beach is being taken by.", "It is a long hair man which a photograph of a beach is being taken by.", "It is a long hair man which a photo of a beach is being taken by.", "It is a long hair man that a photograph of a beach is being taken by.", "It is a long hair man that a photo of a beach is being taken by.", "It is a long hair man by which a photograph of a beach is being taken.", "It is a long hair man by which a photo of a beach is being taken.", "It is a long haired man a photograph of a beach is being taken by.", "It is a long haired man a photo of a beach is being taken by.", "It is a long hair man by who a photograph of a beach is being taken.", "It is a long hair man by who a photo of a beach is being taken.", "It is a long hair man a photograph of a beach is being taken by.", "It is a long hair man a photo of a beach is being taken by."], "swap subj/obj+it cleft: ARG1": ["It is a photograph of a beach who is taking a long haired man.", "It is a photo of a beach who is taking a long haired man.", "It is a photograph of a beach which is taking a long haired man.", "It is a photo of a beach which is taking a long haired man.", "It is a photograph of a beach that is taking a long haired man.", "It is a photo of a beach that is taking a long haired man.", "It is a photograph of a beach who is taking a long hair man.", "It is a photo of a beach who is taking a long hair man.", "It is a photograph of a beach which is taking a long hair man.", "It is a photo of a beach which is taking a long hair man.", "It is a photograph of a beach that is taking a long hair man.", "It is a photo of a beach that is taking a long hair man."], "swap subj/obj+it cleft: ARG2": ["It is a long haired man who is being taken by a photograph of a beach.", "It is a long haired man who is being taken by a photo of a beach.", "It is a long haired man which is being taken by a photograph of a beach.", "It is a long haired man which is being taken by a photo of a beach.", "It is a long haired man that is being taken by a photograph of a beach.", "It is a long haired man that is being taken by a photo of a beach.", "It is a long hair man who is being taken by a photograph of a beach.", "It is a long hair man who is being taken by a photo of a beach.", "It is a long hair man which is being taken by a photograph of a beach.", "It is a long hair man which is being taken by a photo of a beach.", "It is a long hair man that is being taken by a photograph of a beach.", "It is a long hair man that is being taken by a photo of a beach."], "swap subj/obj+passive: ARG2": ["A long haired man is being taken by a photograph of a beach.", "A long haired man is being taken by a photo of a beach.", "A long hair man is being taken by a photograph of a beach.", "A long hair man is being taken by a photo of a beach."]}, "sentence2": {"original": ["A man swimming in the sea."]}, "pairID": "6796432180.jpg#2r1c", "captionID": "6796432180.jpg#2"}
